[
  {
    "Name": "Zlata",
    "Date": "April 5, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for Alina P to be in the Will of Jesus Christ and for her to fulfill her destiny in Jesus and for her to grow stronger in the Lord every single day and for her to hear Jesus and His Will and His Holy Spirit and follow Holy Spirit in every single move of her life and for her to be given wisdom in every sphere of her life amen\nfor Gods Will to be done in Alina P life, for her to be set free from all dark spirits and for her to be set free from any evil spirits, bondage, curses, ties, for her to be set free from all spirits of fear amen"
  },
  {
    "Name": "Anonymous",
    "Date": "April 5, 2023",
    "Email": "mwpi@rushmore.com",
    "Phone": "605-430-0014",
    "Prayer Request": "Pray my mother's blood sugar level is normal and for her to be healed of type 2 diabetes.  Also, pray she has no side effects from medication, is free of an overactive bladder, has no problems with her back, handles stress well and has normal blood pressure."
  },
  {
    "Name": "Demajay",
    "Date": "April 4, 2023",
    "Email": "demajayfryer32210@gmail.com",
    "Phone": "2055320821",
    "Prayer Request": "Demajay  and Cassandra  Favor with eviction notice and eviction case, with The villas at Ortega and Karen C manager, Whitney H. Daly, Judge and Jody P. in Jesus mighty name. The case will be dismissed, judge ruled in our favor and we are staying in our apartment 130 in Jesus mighty might name."
  },
  {
    "Name": "Dan",
    "Date": "April 4, 2023",
    "Email": "mtboah@protonmail.com",
    "Phone": "",
    "Prayer Request": "Intercession please for the Lord to quickly provide for urgent financial needs as well as the open door for a new profession where I can use my talents and gifts. Underemployment and unexpected expenses have created a situation of lack that seems to be snowballing. Thank you very much"
  },
  {
    "Name": "Anonymous",
    "Date": "April 4, 2023",
    "Email": "analruvalcaba@yahoo.com",
    "Phone": "6023870457",
    "Prayer Request": "I need a prayer for my father who is battling cancer. Right now he’s stable with Dedifferentiated liposarcoma, he has a CT and a MRI Monday April 10, and I want all of us to pray for clear scans, healing  and stability until his next set of scans in 3 months (July) our god is so amazing, and he listens to us. Let’s pray for my fathers healing for his cancer and to everyone in the world struggling with cancer or any type of health. "
  },
  {
    "Name": "Theresa",
    "Date": "April 4, 2023",
    "Email": "soltheresa@yahoo.com",
    "Phone": "2075009083",
    "Prayer Request": "Please pray for dennis and terry that the eyes will be open to the deceit , bias and lies against them. Expose the lies of one of the town members to the evilness against dennis and terry. restore friends back into their lives bring them safety."
  },
  {
    "Name": "Anonymous",
    "Date": "April 4, 2023",
    "Email": "Julielharris70@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my son Dylan to get this approval today. Pray he can get this job and be independent. He has been rejected by so many jobs finally has an offer and it hinges on this approval we are waiting for. Please pray it comes today. God has put him through a growing challenging painful time and we are praying it is coming to an end. Please pray for approval today. In the name of Jesus I pray. Amen"
  },
  {
    "Name": "Ben N",
    "Date": "April 4, 2023",
    "Email": "bentnewton@yahoo.com",
    "Phone": "",
    "Prayer Request": "I seek to be fully confessed and surrendered to God and focused on Him. I also seek prayer with a potential job opportunity. I am set to meet with someone to see if they can check on my job that has been open a while and see how else they can help. I want to acknowledge God in this conversation and seek His wisdom, guidance, and direction. I also seek prayer for peace and joy with the family and everyone involved with the move and peace and contentment with the salary."
  },
  {
    "Name": "Abdul",
    "Date": "April 4, 2023",
    "Email": "abdulrazak.baluch@gmail.com",
    "Phone": "971567145129",
    "Prayer Request": "Hi please pray for me andy wife ...we have been in and out of sickness .. please pray for us to heal completely . I trust and have faith in the lord to heal us .\nMy wife has prediabetic and bacteria infection.\nI keep removing mucus . And urinate alot not sure if it's any sickness or infection or disease .please pray for our healing \n\nPray for my mom to be able to fully recover and get out of bed and walk ....recently she has been running out of breath each time she tries to stand . Pray whatever is stopping her from breathing to stop in Jesus mighty name .\nAnd that she may be able to walk .in Jesus name .\nMy name is Abdul, My wife Lucy, My mom Asha"
  }
]