[
  {
    "Name": "Paul H",
    "Date": "April 3, 2023",
    "Email": "pbunyon40@gmail.com",
    "Phone": "6025760870",
    "Prayer Request": "I need prayer for my wife Sherry. She is at a crossroads with her job and health both physical and mental.She is currently in remission from non Hodgkins lymphoma but has recently had other health related setbacks from chemo and also lost her father to cancer 2 years ago and hasn't processed  the loss.  I am praying for healing and mental clarity that she needs to continue forward and hear the holy spirit more clearly in her life on where her path is leading. She is having difficulty  in her job as it is extremely emotionally  taxing and doesn't know if she can or should keep doing it"
  },
  {
    "Name": "Anonymous",
    "Date": "April 3, 2023",
    "Email": "stopher1@protonmail.com",
    "Phone": "",
    "Prayer Request": "For career direction, all the money I need to study for complete payment of personal loan and credit card balances, to do the will of God in my career and earn the money God wants me to have and to be able to give more than I am currently giving and to help my parents in retirement "
  },
  {
    "Name": "Amy",
    "Date": "April 3, 2023",
    "Email": "ayed820@gmail.com",
    "Phone": "623-256-8101",
    "Prayer Request": "I would like to ask for prayer for my son who is at NAU that God protects him and that he will find friends that love the Lord.  He is dating a young lady and since that have been dating he has kind of been distant from me and the family. I need prayer that he comes back to the Lord and he does islet himself from us and that he makes the right choices of continuing being pure and honoring God.\n\nAlso, would like prayer that God gives me the wisdom to be there for my son and what I can do to speak truth to him.  My son is an amazing young man who loves the Lord and I don't want this broken world to take his focus off of the Lord.\n\nThank you all what you do for all of us."
  },
  {
    "Name": "Amy",
    "Date": "April 3, 2023",
    "Email": "ayed820@gmail.com",
    "Phone": "623-256-8101",
    "Prayer Request": "I need prayer for one of my co-workers that is having/ going through a medical issue.  He is having a biopsy done sometime this week.  He is very worried.  I know our God is AMAZAING  and know he will touch him with his healing hands and give him the strength to go through this step in his life.  He has a family and he is the main provider.  "
  },
  {
    "Name": "Anonymous",
    "Date": "April 3, 2023",
    "Email": "cmk4665t@yahoo.com",
    "Phone": "7609484868",
    "Prayer Request": "Prayers needed for job. Where a customer supposedly got hurt. They are taking this to court. Prayers that this DOES NOT CAUSE ME TO BE TERMINATED. I HAVE never been in any situation like this so I dont know what can happen. Prayers for protection that I DONT lose my job.  Amen"
  },
  {
    "Name": "Anonymous",
    "Date": "April 3, 2023",
    "Email": "noemail@pureheart.org",
    "Phone": "000000000",
    "Prayer Request": "A school friend from England has just lost her Dad. She retired early to be able to care for him. He was 90 and lived a good life. Asking for prayers for my friend, Julia & her family at this time. Julia is feeling exhausted and lost right now. Prayers that she will feel fully restored and that arrangements for Dad's service etc will run smoothly. I only ever knew her Dad as 'Julia's Dad' but he was a good Christian man. Thank you."
  },
  {
    "Name": "Anonymous",
    "Date": "April 3, 2023",
    "Email": "madison01610@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for physical healing, divine connections, wisdom, and financial increase for Shawna P. In Jesus Name -thank you and bless you."
  },
  {
    "Name": "Anonymous",
    "Date": "April 3, 2023",
    "Email": "laxmibailax22@gmail.com",
    "Phone": "9474218863",
    "Prayer Request": "I hav applied for pre primary teacher job... Interview is over .. now pray for me to be selected for this job as I hav no job I need this job plz pray plz pray for me"
  },
  {
    "Name": "Demajay P",
    "Date": "April 2, 2023",
    "Email": "demajayfryer32210@gmail.com",
    "Phone": "2055320821",
    "Prayer Request": "Demajay P and Cassandra P.Favor with eviction notice and eviction case, with The villas at Ortega and Karen C manager, Whitney H. Daly, Judge and Jody Phillips in Jesus mighty name. The case will be dismissed, ruled in our favor and we are staying in our apartment in Jesus mighty might name."
  },
  {
    "Name": "Lisa",
    "Date": "April 2, 2023",
    "Email": "lisa.christen@cox.net",
    "Phone": "6026954902",
    "Prayer Request": "Prayer asked for my daughter who has severe mental illness, is Suicidal and was admitted to a Psych hospital on 4.1.2023.  This is not an April fools joke. My own mother has nothing but hatred and contempt for me as she doesn't understand mental illness and blames me. I feel defeated as i am a single adoptive parent of 3. There is no family support.  I have my family of choice that supports me. "
  },
  {
    "Name": "Tatyana",
    "Date": "April 2, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\n\nThank you from all my heart for your prayers for me and my family in Ukraine. I was able to talk to them today. Glory to God, they are safe after another severe bombings last night. Probably the poisonous chemicals were used again in bombs because my brother Michael has severe nose nose bleedings, his wife Angela's kidney inflammation is worse, their son Eugene's wound on his right leg is worse. Their friend Vadim is in excruciating pain whose right side of the body got paralyzed after working outside all day. My family is running out of donated money. My fundraiser is struggling to get contributions. The most horrifying news is that Russians are advancing on the regions around my family. Bakhmut and Avdiinka are strategic points in winning war for Ukraine now. Avdiivka is greater because it's a key point to take Bakhmut. Every day more than 1,000 soldiers are killed there. Only God can save them and the river dam, which very close to them. Please continue your powerful prayers for safety of the river dam, my family's safety, for Michael's complete cure from nose bleedings, Angela's complete kidney healing, for Eugene's wounds healing and to find a better job, money to survive, keep their apartment, and for my fundraiser get donations to help them, stop Russian attacks, and peace in Ukraine.  Please, special prayer to save Ukrainian troops in Bakhmut and Avdiivka Cities until Ukrainian troops start counter-offence in the middle of April (they can't start now due to the shortage of weapons). A prayer for me too, please, because I have been feeling very ill due to my kidneys' work only 37% and severe inflammation in my body and friend Vadim whose right side of the body got paralyzed after the bombing in Ukraine.\n\nPraying for you and your family's safety and wellness. May God shower all of you with abundant blessings endlessly.\n\nHave a blessed week. \n\nTatyana.\n\nPrayer list: Michael, Angela, Eugene, Vadim, (Andrew, Alex B, Alex N, Ivan-soldiers), Tatyana, Olga, Dmitry, Vova, Nataya, Nikolay.\n\n"
  },
  {
    "Name": "Dom B.",
    "Date": "April 2, 2023",
    "Email": "Themrsalways@aol.com",
    "Phone": "859-982-7334",
    "Prayer Request": "Can you please pray for my family to find a house with better schools so I don't fear for my children safety daily. I am recently separated from my husband and my kids and I are on our own with no support from my husband. I am being strong for my kids but when they sleep , I cry and pray to God for help. Please pray for strength and safety over my family because I am so tired. God we need you! Please God help us!"
  },
  {
    "Name": "Christopher",
    "Date": "April 2, 2023",
    "Email": "Christopher_bakker@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray for Gods will to be done in my life and for me to be set free from all dark spirits. In Jesus's name, Amen"
  },
  {
    "Name": "Craig",
    "Date": "April 2, 2023",
    "Email": "craigdalejohn@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray  my teeth and ears  to be healed.\n\nThanks "
  },
  {
    "Name": "Anonymous",
    "Date": "April 1, 2023",
    "Email": "annette7404@gmail.com",
    "Phone": "",
    "Prayer Request": "I am so exhausted in my life at the age of 72, nothing is working for me, we need to sell our condo and move to a smaller unit, no one is buying it.  My son Dan  been praying for him to do well in his career, be financially independent, again nothing is happening, I cannot take this pressure.  Please pray for Dan and his wife to have a happy and prosperous life together. Help my two boys to be very close to each other. Help me do well in work to pay our bills and live comfortably please.  I am too stressed out, worried all the time, no matter how much I pray, nothing is working for me."
  },
  {
    "Name": "Theresa S",
    "Date": "April 1, 2023",
    "Email": "soltheresa@yahoo.com",
    "Phone": "2075009083",
    "Prayer Request": "Pray for restoration , people to stand up for us, eyes to be opened in the town all the evilness that has been done to us. Softened the hearts all around us."
  },
  {
    "Name": "Zlata",
    "Date": "April 1, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for Gods Will to be done in my life and for me to be set free from all dark spirits amen"
  },
  {
    "Name": "Anonymous",
    "Date": "April 1, 2023",
    "Email": "fernandesaaron21@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my family's salvation and my own salvation."
  },
  {
    "Name": "Zlata",
    "Date": "March 31, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for all the prayers Aik H has spoken towards me this year to return upon his own head in the Name of the Father and the Son and the Holy Spirit amen"
  },
  {
    "Name": "Ben N",
    "Date": "March 31, 2023",
    "Email": "bentnewton@yahoo.com",
    "Phone": "",
    "Prayer Request": "I seek prayer, and confession for deceit lying and exaggerating. I want this struggle ended. I also seek wisdom, guidance, and direction for sharing and speaking in truth. "
  },
  {
    "Name": "Anonymous",
    "Date": "March 31, 2023",
    "Email": "noemail@pureheart.org",
    "Phone": "000000000",
    "Prayer Request": "Phone call into the office this morning. M has a court appearance in an hour. Prayers that the judges heart softens. Allegations are seen for what they are - false. To be reunited with her son. Family to be reunited again. Thank you"
  },
  {
    "Name": "Anonymous",
    "Date": "March 31, 2023",
    "Email": "jabuscity@gmail.com",
    "Phone": "",
    "Prayer Request": "Is she the one for me, before I make this choice? Please praise for me. Marriage is a serious matter. I really need answers, a sign before I commit. Thank you. Be blessed.  "
  },
  {
    "Name": "Julie",
    "Date": "March 30, 2023",
    "Email": "restinlove@protonmail.com",
    "Phone": "",
    "Prayer Request": "Could you please pray that God would protect me?  There is something that interferes with my being able to fall asleep every night.  I am sleep deprived.  I am suffering so much and I am desperate for help.  Please pray for me."
  }
]