[
  {
    "Name": "Zlata",
    "Date": "March 30, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for Alina to be in the Will of Jesus Christ and for her to hear His Voice and follow His lead and for her to have wisdom for every single area of her life and for her to know the next steps to be taking"
  },
  {
    "Name": "Terry",
    "Date": "March 30, 2023",
    "Email": "soltheresa@yahoo.com",
    "Phone": "2075009083",
    "Prayer Request": "Please pray for Dennis and Terry that the town will open their eyes to see the Injustice that's done to them and soften their hearts to have favor and have the select men agree to the request that was made. Pray for a positive write-up in a newspaper on them"
  },
  {
    "Name": "Anonymous",
    "Date": "March 29, 2023",
    "Email": "barbaratreadaway585@gmail.com",
    "Phone": "8036345777",
    "Prayer Request": "Dear God,\n\nI come to you today with a heavy heart and a plea for help. My daughter Jasmin has been sexually abused, and I am asking for your intervention in this situation.\n\nLord, I ask that you provide Jasmin with the help and support she needs to heal from this traumatic experience. Please surround her with loving and caring people who can offer her comfort and guidance. Help her to find the strength and courage she needs to overcome this and move forward with her life.\n\nI pray that this man is brought to justice for his heinous crime. Please guide the authorities and give them the resources they need to arrest him and hold him accountable for his actions. Protect other children from falling victim to his abuse and bring peace to our community.\n\nLord, I also ask that Jasmin's family opens their eyes to the truth of what happened to her. Help them to understand the gravity of the situation and provide them with the wisdom\n"
  },
  {
    "Name": "Zlata",
    "Date": "March 29, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for God to be protecting me from anyone that is not of Him and from harm."
  },
  {
    "Name": "Ben",
    "Date": "March 29, 2023",
    "Email": "bentnewton@yahoo.com",
    "Phone": "",
    "Prayer Request": "I seek a sound mind. I confess such things as anger, resentment and anxiety where I believe devastating lies. I seek to have my mind focused on God. I also seek wisdom, guidance, and direction with a potential job opportunity and how I proceed. I also seek peace and excitement for the family with the move and peace for everyone involved. Additionally, I seek peace and contentment with the salary and other details. I also seek no grandiose prideful thoughts. "
  },
  {
    "Name": "Kenny L",
    "Date": "March 29, 2023",
    "Email": "kennyelamarii@gmail.com",
    "Phone": "3175251601",
    "Prayer Request": "My ex wife and I have been on and off for the past few years. The collapse of the marriage was my fault. I have since changed what I can change and have tried to prove to her on a daily basis that I want our marriage back. She has a lot of folks telling her to call it quits. She isn't speaking to me right now. Please pray that God would bring us back together. I pray that He will give us another chance. I want to have the chance for once in my life to be a Godly husband. I want to reclaim what I allowed the enemy to steal from us. I miss her being my wife. I miss our family. Please pray for Autumn and Kenny. "
  },
  {
    "Name": "Anonymous",
    "Date": "March 29, 2023",
    "Email": "ashleyaromero@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray for my son. He is being bullied badly at school and the principal has not taken any action. The bully has threatened violence, twisted my sons arm and left bruises. My son is not the only child he's done this too. Please pray for my son's protection. I plan to put him in a christian school next year but he still has 2 months left. I'm so worried and have so much anxiety over this. Please pray that the prinicipal takes action over this matter asap and this other kid not be allowed around my son. Thank you."
  },
  {
    "Name": "Zlata",
    "Date": "March 29, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for the Will of Jesus Christ of Nazareth to be done in Alina P life, for her to be set free from all spirits of fear, evil spirits, ungodly soul ties, kundalini, mind control spirits, seduction and perversion spirits, spirits of spiritual abuse and emotional abuse, gaslighting spirits and for her to be full of the Holy Spirit and the Holy Spirit be strong in her amen\n\n\nfor Gods Will in my life, for God to lead me the right steps in my life and for His guidance and protection from any charismatic witchcraft towards me"
  },
  {
    "Name": "April T",
    "Date": "March 28, 2023",
    "Email": "Kershaw2741@gmail.com",
    "Phone": "",
    "Prayer Request": "I am requesting prayer for my mom (Kathy) they saw something on her mammogram yesterday, and need to do a biopsy to make sure there's nothing there. I'd greatly appreciate the prayers that nothing is found once they do the procedure. Thank you"
  },
  {
    "Name": "Daniel",
    "Date": "March 28, 2023",
    "Email": "danielchia900@gmail.com",
    "Phone": "--",
    "Prayer Request": "Pray for my nerves to be healed completely speedily, and also full restoration in my life, and to meet my soulmate soon, and also to improve my financial status and become better, in Jesus name, Amen! Thank you."
  },
  {
    "Name": "Anonymous",
    "Date": "March 28, 2023",
    "Email": "Musicgal46@outlook.com",
    "Phone": "5853211974",
    "Prayer Request": "Pray for Andrea to be healed from a severe stomach hernia. She had surgery to make her stomach smaller, a few years ago. She was moving furniture to clean, lifted up heavy furniture and a treadmill and got the hernia on her stomach, that now needs repair. She can’t keep food down, vomits anything she eats and is tired from vomiting and not getting food for energy. The pain is severe. Also pray for her salvation in Jesus’ name. Pray God heals her, restores her to Himself in Jesus’ name. John 3:16"
  },
  {
    "Name": "Anonymous",
    "Date": "March 27, 2023",
    "Email": "antricks.goodluck@gmail.com",
    "Phone": "0822056520",
    "Prayer Request": "May God help me to go ahead with the project of my Nonprofit OJC and (NathShopping ecommerce) in 2023 by signing a great financing and implementing fruitful partnership with a international organization that will help me create my Dynasty and subsidizing to my daughter Jéïel school fees and get enoughfor my wedding ceremony cost In Jesus Mighty Name (Jeremiah33:3, Matthew7:7, Psalm1:3, Joshua1:8 & Deuteronomy28:8)"
  },
  {
    "Name": "Jacqueline",
    "Date": "March 27, 2023",
    "Email": "jacquelinelewis61@icloud.com",
    "Phone": "",
    "Prayer Request": "Hi ! I Jacqueline Writing For Prayer. I Am Praying God Help Me To Be Comfortable In My New Apartment. I Am A Senior Citizen And Need Help In Resting And Peace And To Comfortable . We I Moved From I Was Picked At By Past Neighbors. So Fear Keep Creeping In . Thanks And God Bless"
  },
  {
    "Name": "Anonymous",
    "Date": "March 27, 2023",
    "Email": "annette7404@gmail.com",
    "Phone": "",
    "Prayer Request": "I am so exhausted in my life at the age of 72, nothing is working for me, we need to sell our condo and move to a smaller unit, no one is buying it.  My son Dan has been praying for him to do well in his career, be financially independent, again nothing is happening, I cannot take this pressure.  Please pray for Dan and his wife to have a happy and prosperous life together. Help my two boys to be very close to each other. Help me do well in work to pay our bills and live comfortably please.  I am too stressed out, worried all the time, no matter how much I pray, nothing is working for me."
  },
  {
    "Name": "Anonymous",
    "Date": "March 27, 2023",
    "Email": "mr58033@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray that God would give me wisdom, hope and courage. Pray that God would deliver me from my current struggles. Finally pray for peace in my life and in my friends."
  },
  {
    "Name": "Brenda F",
    "Date": "March 27, 2023",
    "Email": "farleybrenda776@gmail.com",
    "Phone": "2074936653",
    "Prayer Request": "Wonders may be done by the name of thy holy child Jesus\nActs:30b \nThe holy Bible"
  },
  {
    "Name": "Hayeong S",
    "Date": "March 27, 2023",
    "Email": "slh7@protonmail.com",
    "Phone": "2053012665",
    "Prayer Request": "Please, pray the following for us(Jung-won, Ui-seop, Ha-young, Ye-young, Eun-tae, In-sook).\n\n1. Grant us the glory that is from the one and only God. \n2. Send out your workers into your harvest.\n3. Let the kingdom of God and his righteousness really come upon each of us by the will of God’s son.\n4. Grant us justice against our adversary."
  },
  {
    "Name": "Anonymous",
    "Date": "March 27, 2023",
    "Email": "valerie.pecora@gmail.com",
    "Phone": "704-907-1118",
    "Prayer Request": "Jim and I thought moving to NC would be the best thing for us/our family. Life here has been very tough. Struggles with jobs, finances, health, extended family (that we came here to be near). We do have a good church, but ...\nplease pray for us- we need a breakthrough in all these areas, like yesterday!\nthank you,\nValerie"
  },
  {
    "Name": "Demajay Fryer Parker",
    "Date": "March 26, 2023",
    "Email": "demajayfryer32210@gmail.com",
    "Phone": "2055320821",
    "Prayer Request": "Demajay Fryer Parker Favor with my rent with The villas at Ortega and Karen C manager And assistant manager Vivianna P. Sweeten Karen C and Vivianna P. No evictions filed and to work with me on my rent payment."
  },
  {
    "Name": "Anonymous",
    "Date": "March 26, 2023",
    "Email": "Tatyanashedel@outlook.com",
    "Phone": "4259023114",
    "Prayer Request": "Please pray for my situation. For grace and restoration of my life. Also, for new doors to open and the difficult ones to close. I’m under spiritual attack right now in every sphere after conflict with a friendship. I need all assignments of the enemy destroyed. Peace and favour over my home and family. "
  },
  {
    "Name": "Daniel",
    "Date": "March 26, 2023",
    "Email": "danielchia900@gmail.com",
    "Phone": "-",
    "Prayer Request": "Help me pray for my nerves to heal completely speedily, as it had been many years already, in Jesus name amen!"
  },
  {
    "Name": "Ashley",
    "Date": "March 26, 2023",
    "Email": "Ayager1310@outlook.com",
    "Phone": "602-702-9395",
    "Prayer Request": "My son was recently diagnosed with ADHD and ODD and he is really struggling behaviorally in school. We have started working with a psychologist to help him get through this season. Please pray that we are able to help him grow and make good choices. He is so loving and he loves God. I know that God can help put peace in his heart."
  },
  {
    "Name": "Anonymous",
    "Date": "March 25, 2023",
    "Email": "dokal58676@etondy.com",
    "Phone": "",
    "Prayer Request": "I recently interviewed for a job that is perfect for me. I let nerves get the best of me in the interview and didn’t do nearly as well as I would have liked. Please pray the hiring leader looks favorably on me and my experience and offers me the job. "
  },
  {
    "Name": "Zlata",
    "Date": "March 25, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for the Will of Jesus Christ of Nazareth to be done in Alina P life, for her to be set free from all spirits of fear, evil spirits, ungodly soul ties, kundalini, mind control spirits, seduction and perversion spirits, spirits of spiritual abuse and emotional abuse, gaslighting spirits and for her to be full of the Holy Spirit and the Holy Spirit be strong in her amen"
  },
  {
    "Name": "Anonymous",
    "Date": "March 25, 2023",
    "Email": "Veronicaruss62@gmail.com",
    "Phone": "7862629798",
    "Prayer Request": "Woman in my recovery group tries to cause me harm. Please pray for my protection, and let the demons in her would be bound away from me in Jesus name. Amen "
  },
  {
    "Name": "Liana G",
    "Date": "March 24, 2023",
    "Email": "lianaathome@yahoo.com",
    "Phone": "6023200723",
    "Prayer Request": "Last weekend I had a sewer line back up that cause thousands of dollars of damage. It was caused by tree roots so the insurance company will not cover it. I need prayer to find a good person to help fix the damage and the money to cover it. "
  },
  {
    "Name": "Gina W",
    "Date": "March 24, 2023",
    "Email": "pper12603@yahoo.com",
    "Phone": "8457974610",
    "Prayer Request": "Please pray for my son Jon.\nHe received double sentence for a fight. \nHe’s turn his life around to Christ. \nJudge made it clear it’s because he doesn’t like him. Pray for judge. My husband is struggling with horrific PTSD! My sister and her family no place to live have moved into our 900 sqft house. Rejoice in Gods plan for us. "
  },
  {
    "Name": "daniel c",
    "Date": "March 24, 2023",
    "Email": "dcahill2001@yahoo.com",
    "Phone": "",
    "Prayer Request": "\nHi pastor and all my wonderful brothers and sisters at the Pure Heart church!Homeless at 76 for twenty years and being prayed for on the prayer wall is like having a very sore muscle and sleeping on concrete every night you get them and your prayers are like spiritual heat ointment that takes so much of the pain away so please i am begging you keep me on the wall a little longer!GOD richly bless you for your ministry   brother Danny   3/24/23"
  },
  {
    "Name": "William",
    "Date": "March 24, 2023",
    "Email": "Wbonzibilly@yahoo.com",
    "Phone": "916 688 3958",
    "Prayer Request": "Please pray for my wife, let her be cured of this cancer in her lungs, small intestines and liver, In the name of Jesus, I pray Amen "
  },
  {
    "Name": "William",
    "Date": "March 24, 2023",
    "Email": "gohwilliam633@gmail.com",
    "Phone": "98677367",
    "Prayer Request": "1) Pray for me that i will be able to find favour in the organisers of the paid dialogue sessions i am applying so that they will allow me to join and i will be able to use the reimbursement to supplement my income as i am facing financial challenges.\n\n2) Pray for my Dad that he will be less controlling towards my mum and be more understanding in terms of his actions, thought, speech towards others."
  },
  {
    "Name": "Dee",
    "Date": "March 23, 2023",
    "Email": "hardenk875@aol.com",
    "Phone": "3472719804",
    "Prayer Request": "Can you pray for Anecia, from being deceive from lies and deception that Abba Father will reveal the truth to her about men that's using her and lying to her. \n"
  },
  {
    "Name": "Pamela",
    "Date": "March 23, 2023",
    "Email": "Pamannm@hotmail.com",
    "Phone": "6164260303",
    "Prayer Request": " I been going through allot of trauma and losses, depression and a legal issue. And needing prayers for to get a miracle of a car.  Needing prayers for a breakthrough miracle in my situation.   "
  },
  {
    "Name": "Joyce",
    "Date": "March 22, 2023",
    "Email": "jowoodard1967@gmail.com",
    "Phone": "6029434994",
    "Prayer Request": "please pray for my nephew Aaron woodard last week his best friend passed away. she was only 24. they were as close as brother and sister. he is having a difficult time processing this visitian is tomorrow night and funeral is Friday. pray for her family"
  },
  {
    "Name": "Karen",
    "Date": "March 22, 2023",
    "Email": "luv2longrun@yahoo.com",
    "Phone": "6232030899",
    "Prayer Request": "Please pray for my nephew , Seth and his new wife, Hollie. Seth is a Christian but chose to marry a non Christian.  He is finding out that she is struggling with alcoholism and some demonic possession potentially.  "
  },
  {
    "Name": "Kelly",
    "Date": "March 22, 2023",
    "Email": "kmclanegrim@yahoo.com",
    "Phone": "6236944767",
    "Prayer Request": "Please pray healing for Maddie who was seriously injured by Pfizer's COVID vaccines. "
  },
  {
    "Name": "Jef",
    "Date": "March 22, 2023",
    "Email": "jeffrowlette@hotmail.com",
    "Phone": "19093131398",
    "Prayer Request": "Please God, your child is begging you. You have given me so much more than I deserve but I beg you for to help me and guide me back into her heart. You know me better than all and I promise to dedicate my life to making her happy. I will give up all you gave me in exchange. What use is life without love. I'm begging you to help me. Just a nudge...and guide me back to her who I love so much. I'm not asking for you to do this for me, but please help me...guide me...stay with me and hold my hand. I promise to always do my very best to make her happy. I don't want money...just her love.\n"
  },
  {
    "Name": "Dracus",
    "Date": "March 22, 2023",
    "Email": "Ffirsttry@yahoo.com",
    "Phone": "",
    "Prayer Request": "I got lost in the depression of losing my mom and didn't notice I was losing the love of my life till it was to late.  Now she is with a man who is poisoning her mind body and soul.  Please pray for her to forgive me, remember her love for me and take me back. Please I beg you. My name is Dracus and her name is Kesa"
  },
  {
    "Name": "Anonymous",
    "Date": "March 21, 2023",
    "Email": "Pmariep.1011@rocketmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for a man I truly love that is struggling with all that is going on in his life. Or relationship has been put on pause and I desperately want to get back to a good place with him."
  },
  {
    "Name": "Anonymous",
    "Date": "March 21, 2023",
    "Email": "loiximinesa7@gmail.com",
    "Phone": "561-420-7838",
    "Prayer Request": "I would like someone to pray for breakthrough  over my life. I’m 22 and I can’t drive. I would love to meet my god send husband and friends. I also want God to give me the wisdom and knowledge over my daily life and went to recognize these God send individuals. Pray that God speaks to me through people and dreams. Pray that I overcome the spirit of anxiety and that God be with me on the job."
  },
  {
    "Name": "Tatyana",
    "Date": "March 21, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\n\nImmensely grateful for your prayers for me and my family in Ukraine. I was able to talk to them today. Praise the Lord, they are safe after another severe bombings last night in Zaporizhzhya, which is very close where my family lives. My brother Michael's migraines are getting better, his wife Angela's kidney is getting better too, their son Eugene still has a lot of pain in his right ankle and is limping. Tomorrow is another 12 hours night shift he has to go through. My fundraiser got some donations, but still is struggling to get contributions. The most horrifying news is that Russians are advancing on the regions around my family. Bakhmut and Avdiivka now are strategic points in winning war for Ukraine. Every day more than 1,000 killed there. However, there is an arrest warrant issued for Putin and Russians are running out of weapons and help for Ukrainian army is coming by the end of this month. My family and Ukraine and world have a hope for survival. Please continue your powerful prayers for safety of the river dam, my family's safety, for Michael, Angela, and Eugene's complete healing, to get a better job, money to survive, keep their apartment (Michael, Angela, Eugene), and for my fundraiser get donations to help them, stop Russian attacks, and peace in Ukraine.  Please, special prayer to save Ukrainian troops in Bakhmut and Avdiivka Cities and keep this cities for 3 weeks until the new Ukrainian troops arrive. \n\nYou and your family and church are in my prayers every day. Abundant blessings and good health to all of you day after day.\n\nHave a blessed week. \n\nTatyana.\n\nPrayer list: Michael, Angela, Eugene, (Andrew, Alex B, Alex N, Ivan-soldiers), Tatyana, Olga, Dmitry, Vova, Nataya, Nikolay.\n"
  },
  {
    "Name": "Zlata",
    "Date": "March 21, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for the Will of Jesus Christ of Nazareth be done in mine and Alina P life and for her to be set free from any dark spirits, ungodly soul ties, spirits of abuse and emotional abuse and spiritual abuse and for restoration of her faith and for her to be set free from any spirits of fear in Jesus Mighty Name amen, for God to give her the perfect love that casts out fear in Jesus Name amen and for me to be set free from dark spirits."
  },
  {
    "Name": "Abdul",
    "Date": "March 21, 2023",
    "Email": "abdulrazak.baluch@gmail.com",
    "Phone": "971567145129",
    "Prayer Request": "Hi \nWould like to request prayers for me and my wife . We have been getting sick this whole month . I have got fever twice this month . We feel there is evil spirit trying to hinder with our lives . Please help us pray that we will be healed from any infection any sickness in our bodies . That we will stay healthy in the name of Jesus .Any evil trying to get to us will be blocked in Jesus name .\n\nAlso pray for my mom continue healing and may God help her be able to get back on her feet .\nMy name is Abdul \nMy wife name is Lucy \nMy mom name is asha \nThank you God bless "
  },
  {
    "Name": "Ben N",
    "Date": "March 21, 2023",
    "Email": "bentnewton@yahoo.com",
    "Phone": "",
    "Prayer Request": "I seek a lot of help with deceit, lies, wrong thinking, and self control. I confess when it has not been right. I also seek help for anxiety and a sound mind. I also have a potential job opportunity and seek God’s guidance and wisdom and peace for the whole family with the potential move and salary. "
  },
  {
    "Name": "Zlata",
    "Date": "March 21, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for God to give wisdom to Alina P in all areas of her life "
  },
  {
    "Name": "Anonymous",
    "Date": "March 21, 2023",
    "Email": "mwpi@rushmore.com",
    "Phone": "605-430-0014",
    "Prayer Request": "Pray my brother's wife is healed of costochondritis and is well enough to babysit her grandkids all by herself."
  },
  {
    "Name": "amberly c",
    "Date": "March 21, 2023",
    "Email": "ambrysweets@gmail.com",
    "Phone": "6026210498",
    "Prayer Request": "please pray for pam for complete healing from cancer please pray in Jesus Holy Name"
  },
  {
    "Name": "Rayleta Price",
    "Date": "March 20, 2023",
    "Email": "prayleta78@gmail.com",
    "Phone": "9513832462",
    "Prayer Request": "Hello my name is Rayleta P and me and my 8 year old son Barrin S Jr. have been homeless for some time now and I'm waiting for my EDD claim to be approved so that I can get a nice decent place of our own asap in Jesus mighty name Amen! I reached out to a shelter but I missed their call and I was told that if they're unsuccessful at reaching you that they move on to the next one. So I'm asking for prayer that they call me back asap today and let us into the shelter today. We are in desperate need of a financial breakthrough. "
  },
  {
    "Name": "Anonymous",
    "Date": "March 20, 2023",
    "Email": "mainey2112@gmail.com",
    "Phone": "6026281079",
    "Prayer Request": "Please pray for Scott M. Pray for peace and comfort. Pray he wakes up and is able to say goodbye to his children. Pray for his family and friends. Pray for me........"
  },
  {
    "Name": "Anonymous",
    "Date": "March 20, 2023",
    "Email": "cynthiaconey018@gmail.com",
    "Phone": "2628009666",
    "Prayer Request": "HI PLEASE PRAY THAT CHRIST GIVE ME FINANCIAL MIRACLE AN HELP WITH MY HIGH BILLS DEBT CANCELLATION AN BLESS DEONTE ELAINE YOLANDA TIFFANY ERICA GRANDCHILDREN THANK YOU GOD BLESS "
  },
  {
    "Name": "David P C",
    "Date": "March 20, 2023",
    "Email": "dcarroll304@aol.com",
    "Phone": "+1 01985075081",
    "Prayer Request": "Prayer For Suffering Palestinians.\n\nLord Jesus Christ. Let us pray for the\nSuffering Palestinians\nToday and I'll light a Candle for them every Night and we miss those murdered so much in life. And our Lord Jesus Christ Feels there pain so much in life and I'll love and pray for every Palestinian who's suffering in life every day.\nAmen Lord Jesus Christ."
  },
  {
    "Name": "Anonymous",
    "Date": "March 20, 2023",
    "Email": "hasiajackson15@gmail.com",
    "Phone": "2503078309",
    "Prayer Request": "I graciously ask whoever may be reading this to pray for me to Hashem God.\nI ask that my grandmother's kidneys will be completely healed on this earth and that she will not have to have surgery again and that she will never ever have to have surgery again or anything removed or amputated.\nI offer up all my personal problems for this intention \nI pray this in the Name of the Father and of the Son and of the Holy Spirit. Amen.\n"
  },
  {
    "Name": "Anonymous",
    "Date": "March 20, 2023",
    "Email": "minagonzalez.19@icloud.com",
    "Phone": "8062929527",
    "Prayer Request": "Please I need prayer to keep me and my sons abuser away from us. He’s threatening to take my son from me but me and my son have never been separated. Please pray he stays away from us and we never have to separate "
  },
  {
    "Name": "Gloria",
    "Date": "March 19, 2023",
    "Email": "glopetit92@gmail.com",
    "Phone": "2106658179",
    "Prayer Request": "I just want Evan to be free from addiction. Please pray that this happens. The thought of my boyfriend dying scares me. Pray for him. "
  },
  {
    "Name": "Larry P",
    "Date": "March 19, 2023",
    "Email": "heavenlytunes_7@hotmail.com",
    "Phone": "",
    "Prayer Request": "For healing of my dear brother Arthur D. who has cancer. He starts chemotherapy on Monday morning, March 20th. "
  },
  {
    "Name": "Anonymous",
    "Date": "March 19, 2023",
    "Email": "Francee623@gmail.com",
    "Phone": "6238101156",
    "Prayer Request": "Please pray for my grandson Evan. He is 15 years old and never met his dad.  He is starting to wonder about his dad. Please pray for him and that our family makes the right decisions as we begin to connect him with his dad and his dad’s family and to soften their hearts, so that they are open to meeting Evan and accept him into their family."
  },
  {
    "Name": "Jim",
    "Date": "March 18, 2023",
    "Email": "jimkorger@gmail.com",
    "Phone": "603-943-1501",
    "Prayer Request": " Please pray that Nyla, Remi, Peggy and Alexandra and Tawren, all accept Jesus as their personal Savior sometime in their lifetime as soon as possible."
  },
  {
    "Name": "Anonymous",
    "Date": "March 18, 2023",
    "Email": "seaempresario4@hotmail.com",
    "Phone": "8647758659",
    "Prayer Request": "This may sound like an impossible prayer but I know nothing is impossible for our Good Lord.\n\nI am Leonardo B. A venezuelan refugee seeking asylum in the USA. I fought for the freedom of my country for many years through non profits and civil society. I was recognized by many human rights organizations. The dictator of my country hates my ideas. Now that I am in America my asylum process is very slow. I'm basically stuck here until I have a work permit and papers.\n\nI have a wife and a 3 year old in Venezuela facing danger. I have been without them for almost a year and it's very difficult. Now the government created a program called \"Humanitarian Parole\" where Ukrainians, Cubans and Venezuelans can come to the States if they find an sponsor. It has been difficult for me to find one.\n\nThe problem is that many attorneys from 20 States have opposed this measure and they plan to shut it down by June of this year.\n\nI am a believer, a born - again Christian but I feel God somehow has not been listening to many of my prayers. I need help from other brothers and sisters who can help me pray.\n\nMy prayer request is the following: \n\n- To accelerate my asylum process and become legal.\n- To find an American organization or individual sponsor to bring my wife and little son.\n- To keep the Parole open for Venezuelans fleeing oppression until my family is safe and here with me."
  },
  {
    "Name": "April",
    "Date": "March 17, 2023",
    "Email": "angelflower161@yahoo.com",
    "Phone": "6024715353",
    "Prayer Request": "Please pray for my cousin, Kenny. He's in critical condition after being found unconscious and not breathing for possibly 18 minutes. He needs a miracle to pull through and make a full recovery! He has young children so please pray hard."
  },
  {
    "Name": "Sean",
    "Date": "March 17, 2023",
    "Email": "winsean12@gmail.com",
    "Phone": "8044788348",
    "Prayer Request": "Good morning Heavenly Father I come before you humbly Thanking you for this beautiful day I ask Lord for your forgiveness and protection Lord please forgive me for all my sins Lord I repent for all my sins Lord I also ask for help with blessing me with a financial miracle breakthrough today Lord I'm claiming it in advance in the mighty name of Jesus Thank you Lord Amen. "
  },
  {
    "Name": "Joyce W",
    "Date": "March 16, 2023",
    "Email": "jowoodard1967@gmail.com",
    "Phone": "6029434994",
    "Prayer Request": "I have a meeting going tomorrow 3/17  at  1 to see if I can mention my social security and continue working part time at peckham "
  },
  {
    "Name": "Joyce W",
    "Date": "March 16, 2023",
    "Email": "jowoodard1967@gmail.com",
    "Phone": "6029434994",
    "Prayer Request": "good friend Mike  has just been diagnosed with stage 4 pancreatic cancer. diagnosis is grim. he has a 16 year old daughter and wife. I'm best friends with his wife dana."
  },
  {
    "Name": "Mary",
    "Date": "March 16, 2023",
    "Email": "WaiteKevin484@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my 82 year old dad & my 81 year old mom they have so  many health problems please ask God to send the best doctors nurses & other therapists & workers to their house especially for my father he can hardly walk.& has diabetes. Please ask God to help me with depression,anxiety & fear & a severe weight problem & my husband for substance abuse. Please pray for my entire family & family of origin who disobey God everyday. URGENT!!"
  },
  {
    "Name": "Zlata",
    "Date": "March 16, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for the Will of Jesus Christ to be done in Alina life and for her to be set free from all dark spirits amen"
  },
  {
    "Name": "Anonymous",
    "Date": "March 16, 2023",
    "Email": "reeslauderdale@gmil.com",
    "Phone": "602-632-1973",
    "Prayer Request": "Please pray that my cousin Guy of KCK is totally healed from leukemia.  Pray my entire family accepts Jesus Christ.  Heal my rheumatoid arthritis and Lupus.  Thank you."
  },
  {
    "Name": "Anonymous",
    "Date": "March 16, 2023",
    "Email": "miarchilla@hotmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my son & brother in Christ, Isaac A, so he may pass his NCLEx exam on March 24. This is his second try. Ask God to give him the strength, wisdom and knowledge that he needs to answer the questions properly and pass. May Gods presence be with him everyday."
  },
  {
    "Name": "Jeremiah",
    "Date": "March 15, 2023",
    "Email": "triunion321@yahoo.com",
    "Phone": "7193305248",
    "Prayer Request": "Please pray that God would help me to get the right job training that I need and then that He would help me get the right job placement. Thanks"
  },
  {
    "Name": "joseph",
    "Date": "March 15, 2023",
    "Email": "pray4annab@gmail.com",
    "Phone": "",
    "Prayer Request": "For my relationship with my girlfriend Anna Maria B. She is in South America and trying to find herself on a self-discovery journey. Please pray that she would trust God in our relationship and find peace with us and our relationship for marriage. That I know she is the one for me and God has given me peace about our future marriage but has not given her peace. Please, pray that God gives her peace, that she surrenders her heart to Him and our relationship. That she can trust Him and me and us as a future loving couple. That she is healed from all her past trauma that she has been in. That she has nothing to fear. That I love her, miss her, and waiting for her when she is ready to come back to me. Thank you, Joseph"
  },
  {
    "Name": "Hettie W",
    "Date": "March 15, 2023",
    "Email": "hettieworrells@gmail.com",
    "Phone": "9192736932",
    "Prayer Request": "Pray for blessing over Hettie to have mind of Christ , improve on her reading , improve on her oxygen level in Jesus name Amen. \nPray for blessing over alma kidney Dr appointment March 27 2022 to have successful in Jesus name amen. \nPray for blessing over snicker to have good health and  to be safe in his house in Jesus name amen.\nPray for blessing over alma house in Jesus name amen."
  },
  {
    "Name": "Tatyana",
    "Date": "March 14, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\n\n\n\nThank you from all my heart for your prayers for me and my family in Ukraine. I was able to talk to them today. Glory to God, they are safe after another severe bombings last night. Russians destroyed many budlings and infrastructure in Nikopol City, which is very close where my family lives. My brother Michael still has horrible migraines, his wife Angela has kidney inflammation, their son Eugene is limping and has to go to work and be on his feet all night for 12 hours. They are running out of donated money. My fundraiser is struggling to get contributions. The most horrifying news is that Russians are advancing on the regions around my family. Bakhmut City is a strategic point in winning war for Ukraine. Every day almost 1,000 soldiers being killed there. Only God can save my family and the a river dam, which is very close to them. Please continue your powerful prayers for safety of the river dam, my family's safety, for Michael's cure from migraines, Angela's kidney healing, for Eugene's complete healing, be able to get through his shift, to get a better job, money to survive, keep their apartment (Michael, Angela, Eugene), and for my fundraiser get donations to help them, stop Russian attacks, and peace in Ukraine. Please, special prayer to save exhausted Ukrainian soldiers in Bakhmut City to keep this city for 3 weeks until the new Ukrainian troops come.\n\n\n\nPraying for you and your family and church's safety and wellness. May God shower all of you with abundant blessings endlessly.\n\n\n\nHave a blessed week. \n\n\n\nTatyana.\n\n\n\nPrayer list: Michael, Angela, Eugene, (Andrew, Alex B, Alex N, Ivan-soldiers), Tatyana, Olga, Dmitry, Vova, Nataya, Nikolay."
  },
  {
    "Name": "LJ",
    "Date": "March 14, 2023",
    "Email": "dmjtwj@yahoo.com",
    "Phone": "",
    "Prayer Request": "Praying God’s divine intervention & healing for Lelands restored mental health & well being. Let NO weapons formed against him prosper. Praying Gods protection, mental, physical, spiritual & emotional well being & Gods presence surrounds Leland daily. Praying he gets the medical care, support & resources needed to be healthy and whole. \n"
  },
  {
    "Name": "Craig",
    "Date": "March 14, 2023",
    "Email": "craigdalejohn@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my eye's to be healed."
  },
  {
    "Name": "Angie K R",
    "Date": "March 13, 2023",
    "Email": "angierios089@gmail.com",
    "Phone": "2094306525",
    "Prayer Request": "I need prayer for a good report on my mammogram. "
  },
  {
    "Name": "Ajay M",
    "Date": "March 13, 2023",
    "Email": "ajay_melwani@yahoo.com",
    "Phone": "",
    "Prayer Request": "For last 1 and half month, I am having stomach problems and pain in my back. Also, I don’t know why I smoke and consume alcohol when I do not need both. May be it’s my loneliness.  I request you to please intercede and pray for my peace of mind, good health and permanent abstinence from smoking and drinking. Thank you, regards and God bless\n   "
  },
  {
    "Name": "Geneva V",
    "Date": "March 13, 2023",
    "Email": "08vigil@gmail.com",
    "Phone": "505-377-3722",
    "Prayer Request": "My husband has given up on your marriage he has filled in the courts. I've been standing for my marriage in faith for over a month now. Changing and giving up things that had contributed to my part of a failed marriage. Last night, he popped in and told me I have some paperwork for you to read and sign! It was paperwork dividing our things and wants from the marriage convent. I didn't sign anything he was upset! I told him its not of God to do this! In my flesh I ripped up the paperwork & said \"NO\"!! My husbands heart is hardened to the willingness of working on our marriage. He believes the lies of the enemy and those around him giving him Un-Godly advice. He's attacked by the strongman spirit and the demonic forces which have come upon to kill, steal, and destroy my family & marriage. I rebuke and cast down these evil spirts from taking my marriage by the blood of Jesus Christ and the power invested in me as a praying wife that they shall let lose of my husband & marriage. He's still admit about going thru with this and has told me there's nothing I can do to change his mind. He told me if I don't agree with him then it'll be hell for me. I desperately need help with this prayer. That God will turn this situation around. "
  },
  {
    "Name": "seo w",
    "Date": "March 12, 2023",
    "Email": "golf0607@naver.com",
    "Phone": "01028560607",
    "Prayer Request": "i want to know God's love. his unfailing, eternal, faithtul love. Father's love. i want to experience, and filled with this love. can you pray for me to meet the God you met? the God of Love? because i do need an enconuter of God's love. i need Father.. can you pray for me? "
  },
  {
    "Name": "Anonymous",
    "Date": "March 12, 2023",
    "Email": "spatton107212@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for our son Kerigan. He was raised in church and has always loved the Lord. He is 24 and for the past few years befriended the wrong people which came with a huge struggle in his life and most recently he was with the wrong person while trying to help them with a ride home ended him in trouble because he was in the same car which can potentially ruin his life. Please pray that God will deliver Kerigan from this situation and bring him closer to our Lord and Savior more than ever and that God will intervene and all this will be dismissed so he can put this behind him. Give us strength as a family to help us deal with it along side our son. "
  },
  {
    "Name": "Jill",
    "Date": "March 12, 2023",
    "Email": "jngriesdorn@gmail.com",
    "Phone": "4199538882",
    "Prayer Request": "After years of praying on my own, going to church, praying the rosary (raised Catholic), reading the bible, and following everything the Catholic Church has to the best of my ability for whatever reason my prayers to God for a financial miracle to ease my burdens has gone unanswered for years. The stress of this situation has caused problems for me physically and chipped away at my faith on a daily basis and this is the last thing I am trying before giving up on believing in anything on a spiritual level ever again. I know for a select few God has answered their prayers but I am not one of those select few & I don't want words that I need to hold on to because God loves me because to me that it just words that I really have trouble believing anymore because I no actions have shown me that God has my back and working to help me. Anyone who wishes to pray for me I would appreciate but the only communication I want is that prayers are being said if there is any others no words that will be nothing but false hope to me as I need action not words at this point because I am at rock bottom spiritually, (And before anyone freaks out I am not now and never have been suicidal as I have had a family member end their live in that way and would never put my family through that again). I will just stop believing in God as I have never had any sign of Him hearing me or evening working on a plan to help me out of this nightmare. About time to just rely on myself and no one else including God.\n"
  },
  {
    "Name": "Anonymous",
    "Date": "March 11, 2023",
    "Email": "Ninaofireland@yahoo.com",
    "Phone": "6045578333",
    "Prayer Request": "I ask for prayer to be drawn to God and fall in love with Him again. So much seems to be in the way within me. Please pray for me. Thank you."
  },
  {
    "Name": "Michelle A",
    "Date": "March 11, 2023",
    "Email": "avramfan2@aol.com",
    "Phone": "5418709298",
    "Prayer Request": "Please pray for my brother Mike. He is in the hospital with heart failure and i am flying out tomorrow. Please God watch over us "
  },
  {
    "Name": "Anonymous",
    "Date": "March 10, 2023",
    "Email": "mjw217.mw@gmail.com",
    "Phone": "",
    "Prayer Request": "I am requesting prayer for someone I love very much who has a gambling addiction.  I'm praying for him to be delivered from this and any other addictions that may be afflicting him and for his salvation. This addiction has ended a very long relationship.   His name is Jeff.  Thank you!"
  },
  {
    "Name": "Gregory",
    "Date": "March 10, 2023",
    "Email": "gmcneill6@gmail.com",
    "Phone": "9176983756",
    "Prayer Request": "I need a extension of my Unemployment Insurance. I haven't found a job since being unemployed 5 months ago and need money to pay my bills and take care of myself.  I want to have my Unemployment Insurance until I am able to find a new job and I can transition out of it without any problems. \n And this should apply to those who worked during the pandemic who were essential workers."
  },
  {
    "Name": "Gregory",
    "Date": "March 10, 2023",
    "Email": "gmcneill6@gmail.com",
    "Phone": "9176983756",
    "Prayer Request": "Next week is my daughter's birthday and she will turn 18 years old. I haven't been in her life because my ex GF has made sure that I am not a part of our daughter's life. Family Court can't find her because she has made it hard to find her. It has emotionally wounded me and caused me to not move forward and believing that I have failed as a Father. I believe that when it's time that my daughter will understand that I have tried to find her and wasn't able to and have a relationship with her."
  },
  {
    "Name": "Shereese C",
    "Date": "March 10, 2023",
    "Email": "shereeseclark123@yahoo.com",
    "Phone": "6099639439",
    "Prayer Request": "From Atlantic City new Jersey please lord save Christian M life and soul from Florida "
  },
  {
    "Name": "N Flores",
    "Date": "March 10, 2023",
    "Email": "too_much00@hotmail.com",
    "Phone": "4438323151",
    "Prayer Request": "Please pray the Lord releases miraculous, supernatural, and endless amounts of his favor, breakthroughs, miracles and blessings. I need all my real estate projects to be completed accurately and timely by skilled and highly experienced contractors. All real estate projects must sell way over asking price. I need the Lord to send an electrician for my current project and eliminate all future issues and problems. All roadblocks and hindrances must be removed and bound immediately in the name of Jesus. I also need the Lord to fill me with the holy spirit, so it manifests itself by me, speaking in tongues and shouting. I need to ALWAYS accomplish more in less time, with an explosive growth of abundance, prosperity and favor in my present and future. I need the Lord to show out in my life, and miraculous breakthroughs are happening and will continue to happen even after l go to heaven, they will never stop!!! All obstacles and detours are removed ensuring his miracles and blessings are ALWAYS able to reach me and ARE ALWAYS FULFILLED!!! I need the Lord to immediately cover me with UNSTOPPABLE FAVOR for the rest of my days! He ALWAYS keeps me covered in His blood, favor, grace, love, mercy and always ensure I have an overflow of Jesus’ anointed continuous, non-stop, miraculous, magnificent, perfect amounts of opportunities and open doors. I need the Lord to ensure I ALWAYS have honest, truthful, reliable, dependable, trustworthy, smart, loyal, knowledgeable, and well-connected people who will, can and do help me in every single facet of my life. Every and all things in my life ALWAYS work in my favor, to my advantage and are ALWAYS aligned to His will."
  },
  {
    "Name": "Anonymous Daughter of The King",
    "Date": "March 10, 2023",
    "Email": "starlasmith77@yahoo.com",
    "Phone": "",
    "Prayer Request": "My husband passed away in 2021 and I have told God that I don't want to be alone. I have been praying for my future husband. Please help me pray that the Lord prepares who He has for me quickly and prepares me for him. The loneliness is hard."
  },
  {
    "Name": "Anonymous",
    "Date": "March 9, 2023",
    "Email": "noemail@pureheart.org",
    "Phone": "000000000",
    "Prayer Request": "A gentleman called James called the office today, in need of prayer. He lives in a local apartment complex and has done for the past 8 years. Today, the landlord/management did an inspection. James doesn't feel confident with how it went. He is concerned that they are looking for all sorts of reasons to evict him. So they can re let for a higher rent.\n\nPlease pray for peace for James.  Thank you."
  },
  {
    "Name": "daniel",
    "Date": "March 9, 2023",
    "Email": "dcahill2001@yahoo.com",
    "Phone": "",
    "Prayer Request": "Hi pastor and all my wonderful brothers and sisters at the Pure Heart church!Only if GOD lays me on your heart i am asking prayer for a little happiness homeless at 76 makes me sad sometimes as you can well imagine!GOD bless you   brother Danny  3/7/23"
  },
  {
    "Name": "Roslind",
    "Date": "March 9, 2023",
    "Email": "rrroslind@gmail.com",
    "Phone": "",
    "Prayer Request": "Hello,  I am 69 years old and still working full time as an estate agent with a borrowed car.  \nI lost everything a few years ago. Please pray with me that God will provide me with my own car for not more than R40 000. Thank you and bless you."
  },
  {
    "Name": "Anonymous",
    "Date": "March 8, 2023",
    "Email": "Trevongivens23@icloud.com",
    "Phone": "4197059405",
    "Prayer Request": "I pray Trevon and Alexandra love for each other doesn’t fade I pray they make it back together this time stronger than ever in many ways  I pray neither one forgets how important the other ones and how much they been through together is not overlook "
  },
  {
    "Name": "LJ",
    "Date": "March 8, 2023",
    "Email": "dmjtwj@yahoo.com",
    "Phone": "",
    "Prayer Request": "Praying deeply for Lelands mental well being. Let NO weapons formed against him prosper. Praying Gods protection, mental, physical, spiritual & emotional well being & Gods presence surrounds Leland daily. Praying he is okay and will reach out and contact family /friends today. In Jesus name, Amen!\"\n"
  },
  {
    "Name": "Tien L",
    "Date": "March 7, 2023",
    "Email": "tienlee46@gmail.com",
    "Phone": "6263828542",
    "Prayer Request": "Please pray to The Creator of the Universe that my Mom's reputation on Earth be restored.\nShe was slandered by my father, \nO father in Heaven, Maker of Heaven and Earth, please let this be done immediately, and let the restoration of her good name last forever and ever. Amen."
  },
  {
    "Name": "Tien L",
    "Date": "March 7, 2023",
    "Email": "tienlee46@gmail.com",
    "Phone": "6263828542",
    "Prayer Request": "Our Father who is In Heaven, Maker of the Universe, please send angels like Gabriel and Michael to take over the courts and legal systems and law enforcement on Earth NOW and forever. So that Heaven, Thy kingdom, can be on Earth.\nAnd please give me some more $\nIn the Name of Jesus, Our Salvation. Amen.\n"
  },
  {
    "Name": "Jacqueline M",
    "Date": "March 7, 2023",
    "Email": "jacquelinelewis61@icloud.com",
    "Phone": "",
    "Prayer Request": "Asking For Prayer. I Moved In A New Apartment And My Upstairs Neighbor A Man Keep Monitoring Me Around My Apartment . I Pray God Make This Weird Man Leave Me Alone. Thanks And God Bless"
  },
  {
    "Name": "Tatyana",
    "Date": "March 7, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\nThank you very much for your prayers for my family in Ukraine. I was able to talk to them today. glory to God, they are safe after another severe bombings last night. My brother Michael has horrible migraines, his wife Angela has kidney inflammation, their son Eugene is limping. Probably bombs had neurological chemicals that made my family ill because even their cat walks in circles. During weekend Russians destroyed an apartment building in Zaporizhzhya, which is 3 hours of drive from my family. 13 people are dead and many are injured. This cruelty has to be stopped! Please continue your powerful prayers for my family's safety and safety of the river dam, for Michael's cure from migraines, Angela's kidney healing, for Eugene's complete healing, to get a better job, money to survive, keep their apartment, and for my fundraiser to help them, stop Russian attacks and peace in Ukraine.  \n\nYou and your loved ones and church are always in my prayers. Millions of blessings to all of you.\n\nPrayer list: Michael, Angela, Eugene, (Andrew, Alex B, Alex N, Ivan-soldiers), Tatyana, Olga, Dmitry, Vova, Nataya, Nikolay.\n\n"
  },
  {
    "Name": "AMAL",
    "Date": "March 6, 2023",
    "Email": "amalshades@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for me...\nPlease pray for my wife to get a good paid job.she is currently jobless and suffering a lot.God is our only hope please help her.., please bless her with a good job and health.\nWe do believe that God will hear us and shall bless us from his might...\nAmen \n"
  },
  {
    "Name": "Phillip B",
    "Date": "March 6, 2023",
    "Email": "phillipbartley85@gmail.com",
    "Phone": "5022032751",
    "Prayer Request": "I need prayers for protection for my grandson Cameron from people in Lebanon Campbellsville Kentucky "
  },
  {
    "Name": "Anthony R",
    "Date": "March 6, 2023",
    "Email": "roberts.anthony219@gmail.com",
    "Phone": "",
    "Prayer Request": "Blood of Jesus Christ prayer\n\nPrayer for protection against enemies and any one who may try to harm me. I'm homeless and asking you to pray that God will open up the door to transitional housing so I can have my own place and Car. \nPowerful Protection and angelic assistants.\nCareer, Marriage, Kids ,Financial stability,\nHealing, New friends, New church home,\nDeliverance from drinking and smoking\nFavor, Travel, My own home, Restoration\n\nPrayer against spells and bad omens and people trying to take my life. I have no car and walk and need my family covering.\nRiches and wealth.\nRiches and wealth and wisdom to manage for gods kingdom\nFor God to extend my years from 2023 and beyond like Hezekiah on this earth to be a light to lost souls and people\nFor people to stop trying to assassinate my character and name with lies\nTo see my god son Elias and for me and ex arie C to reunite again and her family and be together\nExceeding abundantly above all can ask or think in Jesus Christ name. Also from witch craft and spells\nSafety\n"
  },
  {
    "Name": "Amanda D",
    "Date": "March 6, 2023",
    "Email": "Dickaj83@yahoo.com",
    "Phone": "",
    "Prayer Request": "I was diagnosed with Covid today. I have never had it before. I don’t feel well but I feel like I’m ok right now. Please pray that the worst part is behind me and I continue to get well instead of worse. My worst fear is dying from it and leaving my kids behind. Please pray for God to place his miracle hands on me and heal me and that I do not get worse. Thank you! "
  },
  {
    "Name": "Viola B",
    "Date": "March 6, 2023",
    "Email": "none@none.com",
    "Phone": "",
    "Prayer Request": "Pray to heal Viola B nasal cavity as it is desperate needs due to brokenness emotional trauma grief lonliness and loss and heal her sleep disorder cause her to have a peaceful nights sleep, heal her attention deficit disorder and personality disorder and  lift up Magdalena L free her from depression and have hair growth and a good nights sleep free her from insomnia and her sleep disorder. lift up Cordelia Vogel."
  },
  {
    "Name": "LiaMarie",
    "Date": "March 5, 2023",
    "Email": "TheDivinelia@outlook.com",
    "Phone": "9206297074",
    "Prayer Request": "Please pray for me and my moms friend that a miracle happens and she is cured of brain cancer  I know it doesn't  always happen but I have faith it will and please use your hands to do it ty so much"
  },
  {
    "Name": "Erin",
    "Date": "March 5, 2023",
    "Email": "prayers103@yahoo.com",
    "Phone": "",
    "Prayer Request": "I’ve been unemployed a long time, w/ many jobs I’ve “almost” gotten. I urgently pray God blesses me now, in March 2023, w/the PERFECT job that has an awesome salary, minimal stress & that I love & excel at it immediately. I pray I’m loved, supported & valued by everyone there right away & have excellent job security. I pray I’m hired on the spot & that I love going to work every day & truly shine. Thank you!!"
  },
  {
    "Name": "James B",
    "Date": "March 5, 2023",
    "Email": "jsla1@live.com",
    "Phone": "5676442038",
    "Prayer Request": "Pray for my ex wife and I to work things out we were talking about it for the last few months but this month it went negative and I need help getting it back on the right track."
  },
  {
    "Name": "Anonymous",
    "Date": "March 5, 2023",
    "Email": "c1parz@aol.com",
    "Phone": "",
    "Prayer Request": "Please pray I do not lose my job and penance is swift and fair and I can continue working as soon as possible. This will allow me to continue to provide for and support my family. Thank you Amen"
  },
  {
    "Name": "Tina U",
    "Date": "March 4, 2023",
    "Email": "tinamans@gm.com",
    "Phone": "7808764329",
    "Prayer Request": " Please pray for my husband John that he will be set free from darkness and the drugs That he would know Jesus"
  },
  {
    "Name": "Zlata",
    "Date": "March 4, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "Hello, as usual asking prayers for my dear friend Alina P -for her well being, her deliverance from dark spirits, that she would be given wisdom in all spheres of her life and that the hand of Jesus Christ of Nazareth would protect her from anything evil and dark powers, that the Holy Spirit would be strong upon her and her life in Jesus Name amen"
  },
  {
    "Name": "Anonymous",
    "Date": "March 4, 2023",
    "Email": "Ninaofireland@yahoo.com",
    "Phone": "6045578333",
    "Prayer Request": "I am in a deep spiritual struggle with the powers of darkness. I need urgent prayer. Please pray for me. Thank you."
  },
  {
    "Name": "Emily Page",
    "Date": "March 4, 2023",
    "Email": "epage@pureheart.org",
    "Phone": "6238063290",
    "Prayer Request": "Please pray for Lyle T, my sisters father in law. He is like a father to both Blake and I. He has had multiple doctor appointments and a biopsy that has shown he is positive for prostate cancer. Here is an update on specific things we need prayer for. \n\nLots of questions still. They are setting up a number of appts with multidisciplinary team, surgical oncologist, radiation oncologist, etc. We will then decide best treatment approach. It has spread to his nerve bundle on left side. This will require more aggressive treatment and complicates things a bit. They will order gene therapy to evaluate the aggressiveness of the cancer. Also will order a PSMA Pet Scan since nerve bundles are involved. They are calling back with soonest appt times. Surgical Oncologist is out of town next week. So hopefully will get in the following week. He also said this has probably been growing for a while, but gene therapy testing will determine more. \nPraying that the nerves can be saved. That the side effects that they are anticipating post treatments will not happen. Also the current side effects will resolve. For his pain to improve asap. For discernment for the best treatment plan. Praying it’s not spread to anywhere else and that they can remove it all and not come back. For strength daily to navigate all that is coming. Increased faith as a family and individually."
  },
  {
    "Name": "Anonymous",
    "Date": "March 4, 2023",
    "Email": "mlasellfree@gmail.com",
    "Phone": "5086310026",
    "Prayer Request": "Dear heavenly father I try my best and glorify your name every chance If get I have only known abusive relationships in my life I ask you to send me a miracle of a good Godly spouse who loves me unconditionally to show what healthy love looks like my faith is in you always \nIn Jesus name Amen "
  },
  {
    "Name": "William M",
    "Date": "March 4, 2023",
    "Email": "Soulsteelsoldierx4@icloud.com",
    "Phone": "",
    "Prayer Request": "My prayer is my dear friend named Sofia. My concern is for her safety and most importantly, her salvation. She s surrounded by harmful influences and prayer is all I have left to help her.  So I humbly ask for prayers for her. She means a lot to me and I don’t want to see her fall. "
  },
  {
    "Name": "Anonymous",
    "Date": "March 3, 2023",
    "Email": "Dangerousmatch@gmail.com",
    "Phone": "5165551212",
    "Prayer Request": "Pray for that old guy I see him everyday on the street. His hands look like he worked hard but now he looks broken living in the street always look at the ground not a sign of happiness. Something broke that man but he not beg or steel I don’t know how he live. Thats a better man than me so I pray for him get healed."
  },
  {
    "Name": "Anonymous",
    "Date": "March 2, 2023",
    "Email": "hjertesmerte@hotmail.com",
    "Phone": "",
    "Prayer Request": "Every little task feels like a mountain. I would love to be in this world but am crippled. I manage to say a daily prayer, but even reaching out here took me a lot, and the world works with deadlines and results and categories that I don’t fit. I fear for the consequences but try to make baby steps, walking by faith and not by sight. Thank you for praying for me. "
  },
  {
    "Name": "Julie",
    "Date": "March 2, 2023",
    "Email": "Jewela467@aol.com",
    "Phone": "6187916052",
    "Prayer Request": "Please pray for Gods strength to get through the hardships I'm facing and for his clear direction. Thank you so very much! "
  },
  {
    "Name": "Luis",
    "Date": "March 2, 2023",
    "Email": "louleeandtee@gmail.com",
    "Phone": "6314284878",
    "Prayer Request": "My wife Teresa has filed for divorce on Feb 18th  2022 the divorce been pending  now she wants to go foward with it  I ask for prayer for God and the holy spirit to break  this divorce into pieces and bring confusion  and for the lord and the holy spirit to  remove the people that are pushing for this divorce and  shut them up  and for the lord and the holy spirit to  speak to  my wife and to soften her  heart to  cancel this divorce and for  restoration  to begin  in the name of jesus it looks impossible now "
  },
  {
    "Name": "Amber",
    "Date": "March 2, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "Pray for your my future spouse and children, that they might be full of faith and God-fearing people.\n"
  },
  {
    "Name": "Amber",
    "Date": "March 2, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "For the ability to be a good example for your children and to be a good child to parents."
  },
  {
    "Name": "Amber",
    "Date": "March 2, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "That I will always be surrounded by the love and support of family and friends."
  },
  {
    "Name": "Amber",
    "Date": "March 2, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "That our faith might be a light to others, especially those who are lost or struggling."
  },
  {
    "Name": "Amber",
    "Date": "March 2, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "The ability to love unconditionally, just as Christ loves us."
  },
  {
    "Name": "Brenda F",
    "Date": "March 2, 2023",
    "Email": "farleybrenda776@gmail.com",
    "Phone": "2074936653",
    "Prayer Request": "All things work together for good to them that love God. \nRomans 8:28 \nThe holy Bible"
  },
  {
    "Name": "Alison",
    "Date": "March 2, 2023",
    "Email": "Ninaofireland@yahoo.com",
    "Phone": "6045578333",
    "Prayer Request": "I am reaching for immediate victory over spiritual \n attacks on my mind. I have a head injury and my struggle is severe. Thank you so much for needed prayers.\n"
  },
  {
    "Name": "Sarah N",
    "Date": "March 1, 2023",
    "Email": "sarahmeza77@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for me that my health starts getting better. Also that i am able to live a more happy and independent life with my children."
  },
  {
    "Name": "April",
    "Date": "March 1, 2023",
    "Email": "april0770@icloud.com",
    "Phone": "6232033331",
    "Prayer Request": "Please pray for Timothy . He went missing yesterday and the Prescott Valley Police are involved. Not sure what happened but please pray for his safety and return to his family"
  },
  {
    "Name": "Anonymous",
    "Date": "March 1, 2023",
    "Email": "brinthapravinkumar@gmail.com",
    "Phone": "",
    "Prayer Request": "1)My mother & my relatives still not accept our love marriage. Please pray for my family unity.\n2) Me and my husband both unemployee now. Please pray for our job and finance. \n3) My husbands ex girlfriend try to break our family life. So please please pray for me & my husbands unity and love. My husband is the one and only person in my life i have no friends and family members. \n4) for baby. I'm waiting for my motherhood for 2 year. Please pray for me.\nThank you"
  },
  {
    "Name": "Robin",
    "Date": "March 1, 2023",
    "Email": "rebnc76@gmail.com",
    "Phone": "",
    "Prayer Request": "Yesterday, a neurologist told me he believes I have Parkinson's Disease.  I have an MRI scheduled to rule out other problems/issues/diseases.  I am asking for thoughts/prayers/whatever that it is not Parkinson's Disease and that whatever is causing my symptoms is curable.   Please send these thoughts my way.  I appreciate it.  "
  },
  {
    "Name": "rudolph m",
    "Date": "March 1, 2023",
    "Email": "rj_moakley@yahoo.com",
    "Phone": "6239792932",
    "Prayer Request": "My wife is in the emergency room with high blood pressure, chest pain, head ache, labored breathing, dizzy spells"
  },
  {
    "Name": "Sally",
    "Date": "March 1, 2023",
    "Email": "Sallybernal03@gmail.com",
    "Phone": "9093198990",
    "Prayer Request": "Please pray son Jimmy our LORD to restore my relationship with him I love and miss him and the children thank you "
  },
  {
    "Name": "Sally",
    "Date": "March 1, 2023",
    "Email": "Sallybernal03@gmail.com",
    "Phone": "9093198990",
    "Prayer Request": "Please pray husband Felix salvation marriage deliverance from alcohol LORD GOD restore my marriage remove his rudeness give him love compassion thank you "
  },
  {
    "Name": "Anonymous",
    "Date": "March 1, 2023",
    "Email": "m.chaplain@yahoo.com",
    "Phone": "5709808923",
    "Prayer Request": "Hello, would you pray for my son Curtis please. He has acute pancreatitis and in a lot of pain even with pain medicine. He is 16. Please pray God heals him as the Great Physician with total healing. Thanks!!!"
  },
  {
    "Name": "Anthony R",
    "Date": "February 28, 2023",
    "Email": "roberts.anthony219@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray this prayer over my life.\n\nMalachi 3:10, KJV: Bring ye all the tithes into the storehouse, that there may be meat in mine house, and prove me now herewith, saith the LORD of hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall not be room enough to receive it."
  },
  {
    "Name": "Tatyana",
    "Date": "February 28, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\n\nThank you from all my heart for your prayers for me and my family in Ukraine. I was not able to talk to them today. Hopefully, they are safe after the severe bombing last night. They are getting better. Angela's right kidney less painful. Glory to our loving God. My nephew Eugene still recovers from the surgery on his throat. His wounds are healed, but it's hard to swallow. Michael struggles with migraines and nose bleedings.  Russians try to damage the river dam, which is very close to them. If it happens, they will be completely flooded. Chances for survival are very small. \n\nThe most devastating news is that Russians started full scale offence last week at the regions around my family. The bombings are a lot worse and attacks are more frequent -- up to 100 per day. Only God can save my family. Please continue your powerful prayers for safety of the river dam, for Michael's nose bleeding and migraines healing, Angela's complete kidney healing, for Eugene's complete throat healing, to get a better job, money to survive, family's safety, keep their apartment (Michael, Angela, Eugene), and for my fundraiser to help them, stop Russian offence and peace in Ukraine. \n\nPraying for you and your families and church's wellness and prosperity. May our loving Lord bless all of you with most abundant blessings today and always.\n\nHave a blessed week. \n\nTatyana.\n\nPrayer list: Tatyana, Michael, Angela, Eugene, (Andrew, Alex B, Alex N, Ivan-soldiers), Olga, Dmitry, Vova, Nataya, Nikolay.\n"
  },
  {
    "Name": "KJ",
    "Date": "February 27, 2023",
    "Email": "twjtwj56@gmail.com",
    "Phone": "",
    "Prayer Request": "Praying for a Breakthrough for God to direct the steps of the God fearing man to Kelsey, that You God ordained to be her husband. Praying she is attracted to & blessed to meet a like minded Christian young adult male who she can grow a friendship, future marriage & children. Thank you in advance for bringing the right Godly man into her life & this relationship will bring honor & glory to your name. "
  },
  {
    "Name": "Theo N",
    "Date": "February 27, 2023",
    "Email": "africanappartments@outlook.com",
    "Phone": "7174561584",
    "Prayer Request": "Please pray that the man that stole my Mini DV Tapes from my relatives Car to scrap it for Car parts to tell me the truth about what he did to them. Those Tapes has many family memories that are irreplaceable. Please pray I find this man as soon as you can. Thank you in advance."
  },
  {
    "Name": "Angela",
    "Date": "February 27, 2023",
    "Email": "aquarinaz@hotmail.com",
    "Phone": "",
    "Prayer Request": "My husband and I are going through seperation. I want to reconcile but he doesn't seem to want to reconcile and don't seem to want to forgive. He also doesn't share much with me. He keeps on not coming home and going night party. Our marriage is joint by God and it's said what God has joint let no one tear asunder. I'm also worried for his relationship w God and I'm afraid he is drifting further and further. Please pray for us and I also have two kids who are starting to be affected by this. I pray the blood of Christ covers all of me and him and our family for protection. As the marriage is joint by God, I leave to God to help us. I am to be still as I have done what I can and the rest is for God to help us.  I am supposed to walk by faith , not by sight. Pls pray for us"
  },
  {
    "Name": "Anonymous",
    "Date": "February 27, 2023",
    "Email": "laykester03@gmail.com",
    "Phone": "602-459-5566",
    "Prayer Request": "Prayers for Stacey and her boys. She had been going through an abusive relationship with her husband. She came and asked me to pray for her. She said the last time we prayed it gives her the ability to focus on her work and not her problems at home. \nPlease pray for her strength, peace of mind, and send her the right people to help her. She is needing a place to stay because she does not have extended family here in Phoenix. \nThank you. "
  },
  {
    "Name": "Valerie C",
    "Date": "February 27, 2023",
    "Email": "vcummings1212@gmail.com",
    "Phone": "7164457107",
    "Prayer Request": "Please pray for a healing miracle for our mother who was just diagnosed with ALS. Only God can heal this awful illness. Please God- return our mom to full health! Thank you"
  },
  {
    "Name": "Brenda F",
    "Date": "February 27, 2023",
    "Email": "farleybrenda776@gmail.com",
    "Phone": "2074936653",
    "Prayer Request": "Pray that radio stations play Gospel songs by Caroll and Brenda Farley."
  },
  {
    "Name": "William",
    "Date": "February 27, 2023",
    "Email": "wages0404@gmail.com",
    "Phone": "98677367",
    "Prayer Request": "Pray that my Dad will abandon his decision to bring the family  to Batam during the good Friday till Easter Sunday so that I will not miss church activities and events."
  },
  {
    "Name": "Taniqua",
    "Date": "February 26, 2023",
    "Email": "taniquaboyd09@gmail.com",
    "Phone": "",
    "Prayer Request": "Lord , please help me. Please help me secure a home for my family. I have put in over 10 applications for homes. Please Lord help me get approved for at least one of the houses. You know I’m trying please wrap your angels around us. Please bless us with a home with a backyard and garage. Please keep me, tywan, and the kids wrapped in your grace and mercy. In Jesus name amen"
  },
  {
    "Name": "Darron K",
    "Date": "February 26, 2023",
    "Email": "dkarizona@gmail.com",
    "Phone": "4808614330",
    "Prayer Request": "PLEASE pray for my son Aidan whose marriage is on the verge of divorce. His wife has said that she feels it's the only option left. My son doesn't want to lose his wife or see their children put through this. My heart is breaking over this. His mother left me 13 years ago and I thought I was over it but to see my son go through this, it's ripping me up inside and the pain I felt then I'm feeling all over again. I just don't want this to happen."
  },
  {
    "Name": "Joseph M F",
    "Date": "February 26, 2023",
    "Email": "jmviper148@gmail.com",
    "Phone": "7345365600",
    "Prayer Request": "Joseph is suffering from a condition where any physical activity will cause him to become physically sick. Doctors have not been able to diagnose his illness. Please pray for his recovery."
  },
  {
    "Name": "Anonymous",
    "Date": "February 25, 2023",
    "Email": "tre3jm@gmail.com",
    "Phone": "",
    "Prayer Request": "Prayer that this bondage cease and that prayer will answered. Praying for Blessings with taxes and for financial breakthroughs in the name of Jesus. "
  },
  {
    "Name": "Anonymous",
    "Date": "February 25, 2023",
    "Email": "Ninaofireland@yahoo.com",
    "Phone": "6045578333",
    "Prayer Request": "I have been struggling severely since having 2 head injuries, one in Sept 2022 and one after a recent in home collapse. I am having difficulty thinking clearly at times and get emotionally overwhelmed. My spiritual struggle is immense. The enemy is attacking my thoughts. Something very oppressive happened to me in my own home as well from which I need deliverance mentally and emotionally as it is affecting me spiritually. Sobs. Thank you for prayers."
  },
  {
    "Name": "LJ",
    "Date": "February 25, 2023",
    "Email": "dmjtwj@yahoo.com",
    "Phone": "",
    "Prayer Request": "Thank you God for the recent blessings bestowed upon Leland. Let NO weapons formed against him prosper. Praying Gods protection, mental, physical, spiritual & emotional well being & Gods presence surrounds Leland daily.  In Jesus name, Amen!"
  },
  {
    "Name": "Vanity",
    "Date": "February 25, 2023",
    "Email": "talbertvanity@yahoo.com",
    "Phone": "9014306875",
    "Prayer Request": "I have a prayer request several women are obsessed with me and will not stop harassing me and mocking everything I do. I suffer from panic attacks, which are affecting my anxiety."
  },
  {
    "Name": "Anonymous",
    "Date": "February 25, 2023",
    "Email": "shariaemami@gmail.com",
    "Phone": "8187957472",
    "Prayer Request": "Please answer my prayer. I want my sister to be happy and heal mentally, physically and spiritually. Please don’t abandon her. She wants a Godly husband who loves her and she loves him. She loves you Lord. Please bless her with this amazing man soon and lift her spirits up. Please heal her mind and heart. Amen."
  },
  {
    "Name": "Anonymous",
    "Date": "February 25, 2023",
    "Email": "jscheirer128@gmail.com",
    "Phone": "6109146554",
    "Prayer Request": "Please pray for my husband… that God leads him on a path back to our family and away from temptation and influences disguising themselves as followers in Christ. Pray for the Spirit to fill him with the strength to save our marriage and withdraw his petition for divorce. In Jesus’ name, amen."
  },
  {
    "Name": "Anonymous",
    "Date": "February 25, 2023",
    "Email": "Ninaofireland@yahoo.com",
    "Phone": "6045578333",
    "Prayer Request": "Please pray for me. I have been sleeping on the couch in my new home and opened an air mattress to let it off gas so I can sleep on it until I get a bed. The chemical smell is making me feel ill. Please pray for my pet and the family upstairs too for no ill effects. Thank you."
  },
  {
    "Name": "bj",
    "Date": "February 25, 2023",
    "Email": "bj@bjb.com",
    "Phone": "",
    "Prayer Request": "My wife, Carolyn, graduated to Glory yesterday   PLEASE……PRAY… DILIGENTLY…in the HOLY SPIRIT…PLZ  PRAY for me & our family, (we have conflict) \nTo be inundated w/ the Holy Spirit & for Him to bring ALL of us to Christ, peace & love.\nThanks, Bob J B.\n"
  },
  {
    "Name": "Erin",
    "Date": "February 24, 2023",
    "Email": "prayers103@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray God blesses me in the next 3 weeks with the PERFECT job, with an awesome salary, minimal stress & most importantly, that I love & excel at it immediately. I pray I’m loved, respected, supported & valued by everyone there right away & have excellent job security. I pray I’m hired practically on the spot & that I love going to work every day & truly shine. I pray that, after years of false starts, disappointments & almosts, this job is what God has been waiting to bless me w/ & that I’m ready now to receive it."
  },
  {
    "Name": "Anonymous",
    "Date": "February 24, 2023",
    "Email": "Ninaofireland@yahoo.com",
    "Phone": "6045578333",
    "Prayer Request": "I am desperately reaching out for God to help and to help me love Him again. I feel estranged from Him.  I ask Him to revive my heart and soul. Thank you."
  },
  {
    "Name": "Anonymous",
    "Date": "February 24, 2023",
    "Email": "Ninaofireland@yahoo.com",
    "Phone": "6045578333",
    "Prayer Request": "I feel hopeless and beyond God's reach. I have made alot of wrong choices. I am soooo depressed. Please pray for me. Thank you."
  },
  {
    "Name": "Michele",
    "Date": "February 23, 2023",
    "Email": "meansmichele5@gmail.com",
    "Phone": "5135707810",
    "Prayer Request": "Hello, my name is Michele. I have 2prayer requests, please!! The first is regarding a certain miracle I have been praying for!! Please pray that God will bring me this miracle!! Second, I am trying to get into a convent!! Please pray that God will help me to get into this convent!!"
  },
  {
    "Name": "AMAL",
    "Date": "February 22, 2023",
    "Email": "amalshades@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for me..I am in a financial crises.i need urgent help to sustain.God is my only hope.I do believe in his might and glory.my God please bless me with thy mercy and miracles.... Amen "
  },
  {
    "Name": "Anonymous",
    "Date": "February 22, 2023",
    "Email": "mr58033@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray that God would deliver me from anxiety and help me overcome every situation I'm facing. Pray that I can overcome every demonic attack and be healed. Pray that God would give me direction and clarity. Finally pray that God would strengthen me and give me peace. "
  },
  {
    "Name": "Lindsay",
    "Date": "February 22, 2023",
    "Email": "littlesinger27@yahoo.com",
    "Phone": "5202563778",
    "Prayer Request": "Please pray for my brother in law, Wayne, and his wife Lindsay. They are on the verge of divorce. Neither are walking with Christ currently. Please pray God will intervene and heal their marriage and their family. They have 4 young children at home as well. Please pray for Wayne’s salvation!!"
  },
  {
    "Name": "Hayeong S",
    "Date": "February 21, 2023",
    "Email": "slh7@protonmail.com",
    "Phone": "2053012665",
    "Prayer Request": "Please, pray the following for us(Ha-young, Ye-young, Ui-seop, Jung-won, Hye-ok, Yul-bin, Suzy, Eun-tae, In-sook, Im-hak, Tan-ae).\n\n1. Give all of us revelation by the will of God’s son and let us know the true father God. \n\n2. Send us workers for the harvest. \n\n3. Take away all the armament of those who stole from us and bind them in bundles to burn all this time and let us divide the spoil. \n\n4. Jesus, come to us quickly with your sovereign power, receive all of us to Yourself, that where you are, there we may be also.(John‬ ‭14‬:‭3‬ )"
  },
  {
    "Name": "Anonymous",
    "Date": "February 21, 2023",
    "Email": "baker.style@yahoo.com",
    "Phone": "",
    "Prayer Request": "Pray for my protection against those that want to take from me in a negative and evil way. Pray for my protection from all evil and negative gossip that is said about me. Pray for my protection from those that have evil intent towards me. IN JESUS' MIGHTY NAME. "
  },
  {
    "Name": "Anonymous",
    "Date": "February 21, 2023",
    "Email": "hotrodlady@hotmail.com",
    "Phone": "6023167418",
    "Prayer Request": "My husband was just diagnosed with mysenthia gravis. Please pray for understanding and coping for him and our family with this rare disease. "
  },
  {
    "Name": "Katarina",
    "Date": "February 21, 2023",
    "Email": "sana_k@net.hr",
    "Phone": "00385",
    "Prayer Request": "Please pray for my brother Dragan, him for good healing, him for good a Job, him for good financial blessing, he would like to win on the e.j.p. ...please pray for my brother Dragan, Thanks, God bless you ... "
  },
  {
    "Name": "Lindsey",
    "Date": "February 21, 2023",
    "Email": "Lindsey.marie787@gmail.com",
    "Phone": "",
    "Prayer Request": "I am passionate about serving God through medicine. I applied to medical school over the summer and have been struggling with the ups and downs of the process. I feel myself starting to get discouraged. I need prayer for patience and resiliency, but also direction/guidance to assess if I’m on the right path. \n\nThank you"
  },
  {
    "Name": "Anonymous",
    "Date": "February 21, 2023",
    "Email": "Mario@vintomaper.com",
    "Phone": "3528097655",
    "Prayer Request": "Please help me change my identity my real name been used by criminals and bless us to get our money back thank you "
  },
  {
    "Name": "William",
    "Date": "February 20, 2023",
    "Email": "wages0404@gmail.com",
    "Phone": "98677367",
    "Prayer Request": "1) Pray for me for the comforting of my throat as currently seems to have the feeling of something stuck there \n\n2) pray for my dad that he can control his emotions,actions and thoughts towards us and others."
  },
  {
    "Name": "Esther",
    "Date": "February 20, 2023",
    "Email": "godfreyesthersarah@gmail.com",
    "Phone": "2044168882",
    "Prayer Request": "Finances 2 come in ,every way! Healthy food, safe rides, healing fr senior narrcist abuse. Protection over home, bank etc. Great favor, wisdom ,direction. JOY ,encouragements! Devine timing, appts. Thank u !"
  },
  {
    "Name": "Jennifer S",
    "Date": "February 20, 2023",
    "Email": "SPITZERH@AOL.COM",
    "Phone": "7576027538",
    "Prayer Request": "Please pray that I feel great at work tomorrow and it's not busy ijnip amen "
  },
  {
    "Name": "Anonymous",
    "Date": "February 20, 2023",
    "Email": "Galaxyjock@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please dear prayer partners join us in praying for our 7 + year old beloved rescue dog, canine family member Lola. She must undergo TCC bladder cancer surgery this Wednesday to help save & extend her life. We love her immeasurably. This is a life extending TCC bladder Cancer/Cystotomy & Mass Tumor Removal Surgery. As well as post operative medications, quarterly re check follow ups of ultrasounds & lab work, regarding our beloved Lola. Please join us in praying for calm & God's peace & strength for us & our dogs during this process. Praying our Lola will survive undergoing cancer surgery, that the surgeon will successfully remove her bladder tumor and all surrounding infected tissue, that the biopsy will miraculously come back benign & not cancerous and that Lola will make a 100% full recovery from the surgery and all will go well throughout & after it.\nThank you sincerely for your kindness & help.\n\nThe Jacobson-Salerno Family. \n\nCheryl, Richard, Lola & Roxanne.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
  },
  {
    "Name": "John T",
    "Date": "February 20, 2023",
    "Email": "johnthomas@gmail.com",
    "Phone": "08111898042",
    "Prayer Request": "Please pray for my deliverance from satanic lust and filled with the holy spirit.kerala India "
  },
  {
    "Name": "Raphel",
    "Date": "February 20, 2023",
    "Email": "raphelkallarackal@gmail.com",
    "Phone": "7331175972",
    "Prayer Request": "Please pray for my daughter RUTH (19 Yrs Old) for complete healing from the depression and she wants to become a normal and lovely girl. She has suicide tendency. Also remove the hatredness from her for her father and to bring a peaceful atmosphere and happiness in the family.\nRaphel\n"
  },
  {
    "Name": "Hayeong S",
    "Date": "February 19, 2023",
    "Email": "slh7@protonmail.com",
    "Phone": "2053012665",
    "Prayer Request": "Please pray the following over us(Ha-young, Ye-young, Ui-seop, Jung-won, Hye-ok, Yul-bin, Suzy, Eun-tae, In-sook, Im-hak, Tan-ae).\n\n“Therefore beseech the Lord of the harvest to send out workers into His harvest.””\n‭‭[Matthew‬ ‭9‬:‭38‬]\n\n“For this is the will of My Father, that everyone who beholds the Son and believes in Him will have eternal life, and I Myself will raise him up on the last day.””\n‭‭[John‬ ‭6‬:‭40‬ ]\n\n“Jesus answered and said to him, “If anyone loves Me, he will keep My word; and My Father will love him, and We will come to him and make Our abode with him.”\n‭‭[John‬ ‭14‬:‭23‬]\n\n“But if I cast out demons by the Spirit of God, then the kingdom of God has come upon you.”\n‭‭[Matthew‬ ‭12‬:‭28‬]"
  },
  {
    "Name": "Deborah C",
    "Date": "February 19, 2023",
    "Email": "dchurch2156@gmail.com",
    "Phone": "6025730847",
    "Prayer Request": "My friend, Scooter went in for surgery and nothing has been heard since.  It's been over 2 hours ago. Asking for prayer for his healing. "
  },
  {
    "Name": "Mary W",
    "Date": "February 19, 2023",
    "Email": "WaiteKevin484@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my 82-year-old dad & my 81-year-old mom they have so many health problems. Please send lots of helpers & cooperate with them in every way. Please pray for me procrastination my physical & mental health. My husband's alcohol addiction & substance addictions. please pray for my entire family & family of origin they disobey God every day. URGENT!!"
  },
  {
    "Name": "William",
    "Date": "February 19, 2023",
    "Email": "wages0404@gmail.com",
    "Phone": "98677367",
    "Prayer Request": "1) Pray for me for the comforting of my throat as currently seems to have the feeling of something stuck there \n\n2) pray for my dad that he can control his emotions, actions and thoughts for tomorrow as our family is attending the funeral proceedings of my grandmother in Batam."
  },
  {
    "Name": "Anonymous",
    "Date": "February 18, 2023",
    "Email": "Drury2280@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my friend Michael who is struggling with a fentanyl addiction. "
  },
  {
    "Name": "Eva",
    "Date": "February 18, 2023",
    "Email": "eva55a@yahoo.se",
    "Phone": "",
    "Prayer Request": "My left EAR is bad, and loud sound disturbs. Please pray for my healing.\n"
  },
  {
    "Name": "Pete",
    "Date": "February 18, 2023",
    "Email": "moonrock1973@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray that God blesses me with the perfect job and career, where I can succeed, thrive and love what I do. Please also pray that I am reconnected and start talking with Karen again. Please also pray that Lady's cancer is healed completely, and that Joan finds new friends and is healed from all health issues. Thank you and God bless you, -Pete"
  },
  {
    "Name": "Anonymous",
    "Date": "February 17, 2023",
    "Email": "tonyja60@live.ca",
    "Phone": "4162142430",
    "Prayer Request": "Blessings .\nMy name is Anthony J.  and I would like to request prayers for the following :\n1. God's protection and Divine Guidance that every demonic and satanic attack launched against me be sent back from whence it came since I am covered in the Blood of JESUS \n\n2. A financial breakthrough as I do 2020, 2021 and 2022 Income Taxes\n\nThank you very much "
  },
  {
    "Name": "Shereese C",
    "Date": "February 17, 2023",
    "Email": "shereeseclark59@gmail.com",
    "Phone": "6099639439",
    "Prayer Request": "From Atlantic City new Jersey please pray for me that God would bless me with money to pay bills and rent "
  },
  {
    "Name": "Phil",
    "Date": "February 17, 2023",
    "Email": "philchavez1611@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my mom Lorraine’s salvation and pray for her healing. She lost her hearing, has memory loss, bad posture, body pain, and high blood pressure. Pray for excellent health. Pray for a long life for Lorraine.Pray for the removal of debt and financial blessings and financial security for Lorraine. Pray Lorraine’s possessions last a hundred times longer and will supernaturally become newer and repaired. Also, please pray for salvation and excellent health and long life for my uncle Seve,aunt Jackie and Pray salvation, healing and long life for my mom's boyfriend Joe who has cancer.. In the name of Jesus Yeshua Hamashiach Amen .  ... Please Pray GOD Blesses me with a life partner real soon in JESUS Name. I've been praying for this since 1995"
  },
  {
    "Name": "Angela",
    "Date": "February 17, 2023",
    "Email": "Icaredaycareang@aol.com",
    "Phone": "6236987105",
    "Prayer Request": "Asking for prayers please. My sister Charlotte was going up north to Munds Park with her grooming van and it kept fishtailing from the icy roads until it flipped over on its side. She’s at Flagstaff hospital right now getting CAT scan and other test done. But please be praying for her and my niece that is with her now and very upset. "
  },
  {
    "Name": "William",
    "Date": "February 17, 2023",
    "Email": "wages0404@gmail.com",
    "Phone": "98677367",
    "Prayer Request": "Pray for me for recovery as i am having discomfort in my throat,seems to have something stuck in my throat. Thanks"
  },
  {
    "Name": "Jim",
    "Date": "February 16, 2023",
    "Email": "jimkorger@gmail.com",
    "Phone": "6039431501",
    "Prayer Request": " Please pray that God heals me of my spiritual affliction."
  },
  {
    "Name": "anthony r",
    "Date": "February 16, 2023",
    "Email": "roberts.anthony219@gmail.com",
    "Phone": "8508467725",
    "Prayer Request": "please pray this bible scripture over my life for covering and my family and friends.\nfor protection and covering for 2023 and beyond. \n\nPSALM 91\n\nalso malachi: 310 for finances, business, career, my own home and apartment, marriage, kids, long life on earth to preach the gospel around the world for Jesus Christ to help bring souls to Jesus Christ, exceeding abundantly above all can ask or think."
  },
  {
    "Name": "Deborah G",
    "Date": "February 15, 2023",
    "Email": "azgypc@gmail.com",
    "Phone": "6025749532",
    "Prayer Request": "Prayer for Dennis S. He has pancreatic cancer. Surgeon attempted to remove tumor. He had to stop as he could not remove it without him dying. He and his wife Naoma need wisdom and direction in this."
  },
  {
    "Name": "Bianca",
    "Date": "February 15, 2023",
    "Email": "Jesus_javier05@yahoo.com",
    "Phone": "6025707960",
    "Prayer Request": "I ask to please have prayer for my son Angelo. He’s 5 and been having a rough time with back pain. So far it’s showing that he is having pulling on his spine. I know and believe God has healed him. I am only accepting healing for him in Jesus name! \nThank you ️"
  },
  {
    "Name": "Anonymous",
    "Date": "February 15, 2023",
    "Email": "Amwatts1987@gmail.com",
    "Phone": "",
    "Prayer Request": "Dear heavenly father I pray that this year 2023 that I’ll be able to get married I pray in the name of Jesus that you send me a faithful devoted man that wants to marry me and be committed to me and love me I pray God that he be in the world of my destiny and my purpose I prayed it I’ll be ready for this man and be a good wife to him I’m ready for love God"
  },
  {
    "Name": "Angie H",
    "Date": "February 14, 2023",
    "Email": "aholliday1967@charter.net",
    "Phone": "",
    "Prayer Request": "Please join my husband and I in prayer for our 22-year-old daughter. She has told us that she is moving from our home and eventually moving her boyfriend in with her. We have told her this is wrong and against God. Please pray that God will intervene and this will not happen. Thank you and God Bless! James and Angie H"
  },
  {
    "Name": "Tammy T",
    "Date": "February 14, 2023",
    "Email": "m30m15tklove@gmail.com",
    "Phone": "6233303743",
    "Prayer Request": "3 years ago my husband was in a really bad accident that has left him disabled and unable to work. Financially we have been struggling since we're down to 1 income with 2 kids. We have been living in a friend's house for about a year now. With the housing market and cost of living being so high, i fear we will need to move out of state in order to just be ok, and be able to Finally get into our own place Please pray for our situation I'm not sure where God is leading us yet, but leaving Az is  scary since we have been here our whole lives and our family is here. Thank you so much. Any extra prayers are so much appreciated "
  },
  {
    "Name": "Gene F",
    "Date": "February 14, 2023",
    "Email": "darthdyztopia@gmail.com",
    "Phone": "7602821180",
    "Prayer Request": "Please pray for my fiance (Mythiah) and me (Gene). The enemy is coming for us and we have no idea what the attack looks like yet. The enemy is threatened by our union and we need a covering of prayer this week. "
  },
  {
    "Name": "Jeremy C",
    "Date": "February 13, 2023",
    "Email": "Jeremychalfant13@yahoo.com",
    "Phone": "6155990206",
    "Prayer Request": "Pray for peace and healing in my body (chest pain). Deliverance from all evil in Jesus name!"
  },
  {
    "Name": "Anonymous",
    "Date": "February 13, 2023",
    "Email": "noemail@pureheart.org",
    "Phone": "000000000",
    "Prayer Request": "A very nice lady came into office today.   Please keep R in prayer. She is in the process of becoming divorced.  She has an addiction which she is trying to get free from, but is having a tough time.  She desperately want's to get clean. Please pray that R.  get's free from this addiction and that she see God's work in her. She prays but the enemy shows himself in her prayers!  Thank you."
  },
  {
    "Name": "Anonymous",
    "Date": "February 13, 2023",
    "Email": "dochito@msn.com",
    "Phone": "4017930072",
    "Prayer Request": "please pray for healing for my husband and myself my children Grandchildren respiratory stomach intestinal infection Mrsa infection high fever  LH Rosy Lino sisters families several health problems for salvation deliverance protection healing for Alessandra and Gloria thank you"
  },
  {
    "Name": "daniel c",
    "Date": "February 13, 2023",
    "Email": "dcahill2001@yahoo.com",
    "Phone": "",
    "Prayer Request": "Hi pastor and all my wonderful brothers and sisters at the Pure Heart church! I am saved yet homeless at 76 if GOD lays me on your heart asking prayer for happiness! GOD bless you    brother Danny   2/13/23"
  },
  {
    "Name": "Hayeong S",
    "Date": "February 13, 2023",
    "Email": "slh7@protonmail.com",
    "Phone": "2053012665",
    "Prayer Request": "Please, pray the following for us(Ha-young, Ye-young, Ui-seop, Jung-won, Hye-ok, Yul-bin, Suzy, Eun-tae, In-sook, Im-hak, Tan-ae).\n\n1. May we all receive direct testimony of You, the only true God the Father, who dwells above all things, rather than relying on things on earth, and through this come to deeply acknowledge Your truth, and set our seal to this, that God is true.\n\n2. King Jesus, please let your kingdom rule over us all. Cast out the evil spirits from us directly with your Holy Spirit, and share with us what we have been robbed of. \n"
  },
  {
    "Name": "Lena L",
    "Date": "February 12, 2023",
    "Email": "urdazzled@gmail.com",
    "Phone": "",
    "Prayer Request": "I seek prayer for a honest God fearing companion. I been divorced now four years, I seek a man that God knows will be good to me, honest, trustworthy and reliable. But mostly accepts me as I am and will love me unconditionally. Amen"
  },
  {
    "Name": "Anonymous",
    "Date": "February 12, 2023",
    "Email": "israel.cruz3333@gmail.com",
    "Phone": "2108985772",
    "Prayer Request": "That my knee that got injured is not serious, that il be able to get immediate appointments with the clinics I will need, that my knee will get taken care of as fast as possible, that my knee, leg and body be protected from infection and disease. Thank you."
  },
  {
    "Name": "Natalie",
    "Date": "February 12, 2023",
    "Email": "natykamian@gmail.com",
    "Phone": "15163033824",
    "Prayer Request": "Prayers for Alex Jeff Sarah's nephew to be healed, Eric, Cynthia Patricia reina And Maria's kidneys to be healed. to Prayers that I would be on fire for God again and His presence more in my life Prayers that I would be one fire for God again I have gotten cold . Prayers for eilda health to be strengthened Jessica her partner and neighbor as well as their loved ones to be saved "
  },
  {
    "Name": "Tammy T",
    "Date": "February 12, 2023",
    "Email": "m30m15tklove@gmail.com",
    "Phone": "6233303743",
    "Prayer Request": "A 10 year old boy Jay'von Grant that attends my sons elementary school died this past week after being hit by a landscaper truck. Jay'von was being raised by his dad who did everything for him and would even take the bus and walk 7 miles each way just to get him into a good school. Jayson is the father and he lost everything that day and he is struggling bad. Please pray for comfort and healing i can only imagine how terrible he feels and please pray that they can raise the money to give Jay'von a proper burial as this was so unexpected. "
  },
  {
    "Name": "Michael C",
    "Date": "February 12, 2023",
    "Email": "Cohenaz71@gmail.com",
    "Phone": "8055124894",
    "Prayer Request": "1. Improvement in my health.\n2. To move asap to an assisted living facility in Southern, CA \n3.Break away from feeling lonely and unhappy due to past mental and physical trauma.\n4. Have the anointing of the Lord's presence again as I once did \n5. Be completely free from any curses or demonic influences in my life.  Thanks."
  },
  {
    "Name": "Anonymous",
    "Date": "February 11, 2023",
    "Email": "kas2027748@maricopa.edu",
    "Phone": "6236871109",
    "Prayer Request": "I would just like to request a prayer for my boyfriends brothers family. Their names are Nathan and Chelsea.  Today they lost a baby. Chelsea went into labor 4 months early and delivered a still born.  If you could just help us pray for strength for both of them and their family as they go through this hard time."
  },
  {
    "Name": "Zlata",
    "Date": "February 11, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for Alina P to be set free from all dark spirits, spirits of abuse, emotional abuse, spiritual abuse, fear, all dark spirits and principalities and for her to be filled with the Holy Spirit strongly and the whole her life and for Jesus Christ Will to be done in her life in the Name of the Father and the Son and the Holy Spirit amen"
  },
  {
    "Name": "Starla S",
    "Date": "February 11, 2023",
    "Email": "starlasmith77@yahoo.com",
    "Phone": "9723024384",
    "Prayer Request": "Please pray for my friend Johnny for salvation and deliverance and for the Lord to heal him from the health issues that he has and memory problems that he has from a stroke that he had a few years back. "
  },
  {
    "Name": "April F",
    "Date": "February 11, 2023",
    "Email": "Sedonaluv@yahoo.com",
    "Phone": "6028209802",
    "Prayer Request": "Marriage, husband become very dark. Dealing with depression. Says he cannot hear God. Says wants divorce. "
  },
  {
    "Name": "Marcia F",
    "Date": "February 11, 2023",
    "Email": "daintyfreeman@icloud.com",
    "Phone": "",
    "Prayer Request": "Please Pray for the protection of Jermy, Ray, Tony, Nick, Gavin Loreen, Marcia, Howard, Tyrone, Oneil, Govan, Everton, Nickette, Ann&family. Brian, Kimone, Pinky, and family, Doreen, and family,shamerio. Pray for the protection from premature death, the spirit of murder, against the spirit of witchcraft and satanic attacks. Oh God glorify yourself in our situation And give us the rest on every side. Scatter, our enemies, and let the name of JESUS be glorified in these situations we are facing oh Lord.Fight for us God and show sign,miracles and wonders,every time the enemies encamp against us in Jesus mighty name. Strengthen our faith in these situations oh Lord and let our enemies know we serve the one and only true living God.Jesus Christ. Elohim,king of kings and Lord of All.Thank you Jesus.AMEN."
  },
  {
    "Name": "Marci",
    "Date": "February 10, 2023",
    "Email": "daintyfreeman@icloud.com",
    "Phone": "0000000",
    "Prayer Request": "Please pray for protection for:Jermy,nick,Oneil,Everton, Gavin,Loreen,Marcia, Rayana,Tony,Howard,Tyrone,nick,shamerio,Brian,Kimone,nickette , pinky&family,Doreen&family,Kaylene,all children in family.Pray against the spirit of death and murder,against premature death and witchcraft.Pray for Ann & family.Glorify yourself Oh Lord, let every enemy see your POWER &Glory in Jesus name."
  },
  {
    "Name": "Amber",
    "Date": "February 10, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "New Job and New Year and New Chapter of my life. Holy Spirit Bring Miracles and Restoration to my life and my spirit. This will require a major miracle. I’m unemployed and out of money. I have no prospects. I pray the overwhelming application process suddenly becomes easy and that in February 2023, I’m hired practically on the spot for an awesome job at an awesome company where I get to use my God-given talents daily, earn a really great salary plus benefits and bonuses and really enjoy going to work each day. Thank you for praying for me."
  },
  {
    "Name": "Ruusa",
    "Date": "February 10, 2023",
    "Email": "Nangoloruusa26@gmail.com",
    "Phone": "0814086588",
    "Prayer Request": "Good day please pray for my mother for financial breakthrough and deliverance, protection, we have been facing many spiritual attacks and i have been praying but nothing please stand with us in prayers her rent is not paid and shes my siblings things are very difficult for us please help. Plus my father is in jail."
  },
  {
    "Name": "Margaret",
    "Date": "February 9, 2023",
    "Email": "margaretethos@gmail.com",
    "Phone": "+12356952356",
    "Prayer Request": "Please pray for me. "
  },
  {
    "Name": "Renee",
    "Date": "February 9, 2023",
    "Email": "srendr@yahoo.com",
    "Phone": "",
    "Prayer Request": "for my dear ex husband, Jeff…I’ve been praying for his salvation and waiting on God in hope for the marriage, but I’ve not had any contact from him since Sept 2021 until yesterday, when he responded to a business-related email, praise God! Pls pray for God to save, heal, and restore."
  },
  {
    "Name": "Anonymous",
    "Date": "February 9, 2023",
    "Email": "plevan@yahoo.com",
    "Phone": "",
    "Prayer Request": "Asking for prayer for my marriage that is in a difficult season.  Barely communicating with my wife.  Would you please pray that we would soften our hearts toward one another and be able to reconcile.  Ask that you would pray that my wife would be able to forgive me for my many mistakes.  Also asking that you would pray for a better relationship between me and my children.  Thank you."
  },
  {
    "Name": "Phil",
    "Date": "February 9, 2023",
    "Email": "philchavez1611@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my mom Lorraine’s salvation and pray for her healing. She lost her hearing, has memory loss, bad posture, body pain, and high blood pressure. Pray for excellent health. Pray for a long life for Lorraine.Pray for the removal of debt and financial blessings and financial security for Lorraine. Pray Lorraine’s possessions last a hundred times longer and will supernaturally become newer and repaired. Also, please pray for salvation and excellent health and long life for my uncle Seve,aunt Jackie and Pray salvation, healing and long life for my mom's boyfriend Joe who has cancer.. In the name of Jesus Yeshua Hamashiach Amen .  ... Please Pray GOD Blesses me with a life partner real soon in JESUS Name. I've been praying for this since 1995 "
  },
  {
    "Name": "John and sylvia",
    "Date": "February 9, 2023",
    "Email": "feag777@gmail.com",
    "Phone": "2512094538",
    "Prayer Request": ",*WE NEED YOUR AGREEMENT WITH OUR REQUEST\npray God all mighty creator of the heavens, earth and all things will grant us new open doors and new opportunities with our business and finances, pray God will grant us new streams of income and unexpected blessings, pray God will make a way where there seems to be no way.\nPray our car will be fixed tomorrow and running perfect.we have been without a car for a month\nPray God will super naturally show up and make a way where there seems to be no way.\nThank you, may God bless you abundantly"
  },
  {
    "Name": "Lillie",
    "Date": "February 9, 2023",
    "Email": "lillielim777@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for a miracle healing of my leukemia cancer (10% chance of survival). "
  },
  {
    "Name": "Karin",
    "Date": "February 8, 2023",
    "Email": "kaki75@hotmail.com",
    "Phone": "",
    "Prayer Request": "Would you please pray for my mum? My mum is having problems with her memory. Please God Jesus show my brothers and sisters you still perform miracles and heal her short term memory. Also help for my sister to get the right insights about my mum in the past from You Father. It hurts the way she most of the time sees my mum. Show her my mum has always been there for her please. Same as me. My mum also always brought her flowers, nice foods and she has never been grateful/ or never really noticed how special that is."
  },
  {
    "Name": "JOSEPH",
    "Date": "February 8, 2023",
    "Email": "JESUSMAIL@WEB.DE",
    "Phone": "0492024752",
    "Prayer Request": "HEALING REVIVAL - FOR INNER AND PHYS: HEALINGS "
  },
  {
    "Name": "Anthony R",
    "Date": "February 7, 2023",
    "Email": "roberts.anthony219@gmail.com",
    "Phone": "",
    "Prayer Request": "Psalm 91. Please pray this scripture for me for protection and covering over me and my family and friends.\n\n"
  },
  {
    "Name": "Anonymous",
    "Date": "February 7, 2023",
    "Email": "mr58033@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray that God would give me the strength to make the right decisions in my life and supernaturally help me to work harder. Pray that God would completely heal my body and mind. Finally pray that God would deliver me from anxiety and depression. "
  },
  {
    "Name": "Tatyana",
    "Date": "February 7, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\n\nThank you from all my heart for your prayers for my nephew Eugene and family in Ukraine. I was able to talk to them today. Glory to our loving God. My brother Michael has flu and his wife Angela has kidney inflammation again. My nephew Eugene recovers from the surgery on his throat and has severe cough. He is back to work, but his wounds are not healed yet. His supervisor demands money for missing days on medical leave or Eugene loses his job. He is devastated, so are his parents and me. The most horrifying news is that Russians are advancing on the regions around my family. I am scared for their lives. Please continue your powerful prayers for Michael's cure from flu, Angela from kidney inflammation, for Eugene's complete healing, his proper medical treatment, for Eugene's supervisor stop blackmailing him, to get a better job, money to survive, and for all my family's health, safety, keep their apartment (Michael, Angela, Eugene), and for my fundraiser to help them,  stop Russian attacks and peace in Ukraine. Please little prayer for me to recover from flu.\n\nPraying for you and your families. Abundant blessings and good health to all of you. \n\nHave a blessed week.\nTatyana.\n\nPrayer list: Tatyana, Michael, Angela, Eugene, (Andrew, Alex B, Alex N, Ivan-soldiers), Dmitry, Vova, Nataya, Nikolay.\n\n"
  },
  {
    "Name": "Barb",
    "Date": "February 7, 2023",
    "Email": "nanabarbiejo@gmail.com",
    "Phone": "6236875985",
    "Prayer Request": "Please pray for my granddaughter Janay pregnant early 2nd trimester, having severe headaches and nausea. Also for salvation for family protection provision HIS HOLY PRESENCE"
  },
  {
    "Name": "Jennifer S",
    "Date": "February 7, 2023",
    "Email": "SPITZERH@AOL.COM",
    "Phone": "7576027538",
    "Prayer Request": "Please pray that I have energy strength protection favor great health do an excellent job it's not busy at work today and tonight and I can go to the store a few times ijnip amen "
  },
  {
    "Name": "Lydia W",
    "Date": "February 7, 2023",
    "Email": "lydiablessed17@gmail.com",
    "Phone": "0746733816",
    "Prayer Request": "Restoration of my marriage and salvation of my husband and all the third parties in my marriage be uprooted in JESUS MIGHTY NAME,the devourers too for anything GOD Didn't plant shall be removed in JESUS MIGHTY NAME,may they not find peace and joy until they completely leave my marriage and home in JESUS MIGHTY NAME "
  },
  {
    "Name": "Antoinette",
    "Date": "February 6, 2023",
    "Email": "aij456@aol.com",
    "Phone": "",
    "Prayer Request": "I am about to be homeless this month and I have a severe chronic incurable health condition. I need God to help me move into my own apartment this month where I am comfortable. I need the Lord to speak to me clearly and help me, not to abandon me. I cry out to him. Amen!\n"
  },
  {
    "Name": "Louie",
    "Date": "February 6, 2023",
    "Email": "Ilgranados0718@yahoo.com",
    "Phone": "9153487320",
    "Prayer Request": "She had having chest pain, they give her something to get relieve from Chest pains?  At sierra Hospital and go home, soon then go to doctor what's causing pain, get treatment, also we can get a ride home after Hospital Visit."
  },
  {
    "Name": "bj",
    "Date": "February 6, 2023",
    "Email": "bj@bjb.com",
    "Phone": "",
    "Prayer Request": "Urgent!  Carolyn has many illnesses and is in a nursing home.   PLEASE……PRAY… DILIGENTLY…in the HOLY SPIRIT For God to totally & permanently heal & deliver her & me from ALL oppression, restore her soul & BRING HER HOME NOW !! !         PLZ  PRAY!!!!!"
  },
  {
    "Name": "Erin",
    "Date": "February 5, 2023",
    "Email": "seagreeneyes103@yahoo.com",
    "Phone": "",
    "Prayer Request": "This will require a major miracle. I’m unemployed & out of money. I have no prospects. I pray the overwhelming application process suddenly becomes easy & that in February 2023, I’m hired practically on the spot for an awesome job at an awesome company where I get to use my God-given talents daily, earn a really great salary plus benefits & bonuses & really enjoy going to work each day. Thank you for praying for me. "
  },
  {
    "Name": "Nickole W",
    "Date": "February 5, 2023",
    "Email": "nickibaby88@yahoo.com",
    "Phone": "480-376-5291",
    "Prayer Request": "I would like prayer for my 4 month old baby girl Kinsley. She is having open heart surgery on Wednesday February 8th."
  },
  {
    "Name": "Anthony R",
    "Date": "February 5, 2023",
    "Email": "roberts.anthony219@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray psalm 91 for me for safety at night and day. Homeless and need an apartment. Please pray God open up an apartment immediately I need one and car and job and finances.\n\n91 He that dwelleth in the secret place of the most High shall abide under the shadow of the Almighty.\n\n2 I will say of the Lord, He is my refuge and my fortress: my God; in him will I trust.\n\n3 Surely he shall deliver thee from the snare of the fowler, and from the noisome pestilence.\n\n4 He shall cover thee with his feathers, and under his wings shalt thou trust: his truth shall be thy shield and buckler.\n\n5 Thou shalt not be afraid for the terror by night; nor for the arrow that flieth by day;\n\n6 Nor for the pestilence that walketh in darkness; nor for the destruction that wasteth at noonday.\n\n7 A thousand shall fall at thy side, and ten thousand at thy right hand; but it shall not come nigh thee.\n\n8 Only with thine eyes shalt thou behold and see the reward of the wicked.\n\n9 Because thou hast made the Lord"
  },
  {
    "Name": "Nannette B",
    "Date": "February 5, 2023",
    "Email": "wnstmgod2@aol.com",
    "Phone": "9193959738",
    "Prayer Request": "I need financial prayer because social security is holding up my social security income they refuse to process my paperwork in return causing me and my family financial hardship"
  },
  {
    "Name": "Ha-yeong S",
    "Date": "February 5, 2023",
    "Email": "slh7@protonmail.com",
    "Phone": "",
    "Prayer Request": "Please, pray the following for us(Ha-young, Ye-young, Ui-seop, Jung-won, Hye-ok, Yul-bin, Suzy, Eun-tae, In-sook, Im-hak, Tan-ae, you).\n\nJesus, forgive our sins and grant us the true freedom you promised. Remove all blinders from our eyes, which you have called the lamp of our bodies, so that when our eyes are clear, our whole body will be filled with light, according to your word.\n\nJesus, even if we stubbornly follow you, no one can come to me unless the Father who sent me should draw them, and just as you said, I will raise them up. All our efforts are in vain if God does not work in us.\n\nIn John 5:44, it is said, \"How can you believe when you receive glory from one another and do not seek the glory that comes from the only God?\" Lord Jesus, we pray that you would give us all the glory that comes from the only true God, not from mere humans. The glory that the Father, who has loved the Son from the beginning, has given to him.\n\nMay God grant us faith (emunah) and keep us steadfast, so that we may not waver. May he soon bestow upon us the kingdom and enable us to live, so that we may give praise for all that God has done for us."
  },
  {
    "Name": "Ha-yeong S",
    "Date": "February 5, 2023",
    "Email": "slh7@protonmail.com",
    "Phone": "",
    "Prayer Request": "Please, pray the following for us(Ha-young, Ye-young, Ui-seop, Jung-won, Hye-ok, Yul-bin, Suzy, Eun-tae, In-sook, Im-hak, Tan-ae, you).\n\n1. Jesus, please send us your word directly and quickly fulfill your will. May our personal desires and actions all be aligned with your will.\n\n2. Jesus said that no one can come to the Father except through him. Also, no one knows the Father except anyone to whom the Son wills to reveal Him. God's son Jesus, we ask that you designate us all as those who directly reveal the Father God, and give each of us your presence, so that we may know the Father God. As a result, we all hope to achieve true repentance and become one with the Father God to achieve completeness.\n\n3. King Jesus, please let your kingdom quickly rule over us all. May we keep your commandments and soon dwell together with all of us.\n\n4. Cast out the evil spirits from us directly with your Holy Spirit, and share with us what we have been robbed of. "
  },
  {
    "Name": "Jake",
    "Date": "February 5, 2023",
    "Email": "jake@jakeelsley.com",
    "Phone": "",
    "Prayer Request": "I’d love to know that Debra is well; prayer that I hear from her "
  },
  {
    "Name": "Anonymous",
    "Date": "February 5, 2023",
    "Email": "starlasmith77@yahoo.com",
    "Phone": "",
    "Prayer Request": "My husband passed away Sept. 8, 2021. I am 59. I have told the Lord that I don't want to be alone so I started praying for my future husband. A couple of months back by \"accident\" I came in contact with an old friend. He was my boyfriend when I was 17. We started chatting and really connected. His wife passed away on Sept. 9, 2021 the day after my husband passed away. I have custody of grandkids because I have a daughter that chose drugs. He has custody of grandkids because he has a daughter that chose drugs. We both connected and said that we really care for each other. He recently told me that he isn't ready for a relationship and kind of just cut me off. My heart hurts. I am so strongly drawn to him more than I have ever been to anyone and I care for him deeply. I know that he needs deliverance from some things in his life and needs a more intimate relationship with God. He also has memory problems from a stroke that he had several years back. Please pray for him. His name is Johnny and please pray for the Lord's will to be done concerning our relationship. I know that nothing is impossible for God and He can turn it around if we are supposed to be together.  \n"
  },
  {
    "Name": "Anonymous",
    "Date": "February 4, 2023",
    "Email": "Denisewhite196255@gmail.com",
    "Phone": "",
    "Prayer Request": "Please keep my husband's friend Scott in prayer. He recently developed a cough and felt unwell. Went to hospital last Monday and was admitted. He has been diagnosed with stage 3 lung cancer. Because of where the mass is, surgery is not an option. Prayers for peace in this battle and that he will be healed from the top of his head to the souls of his feet."
  },
  {
    "Name": "Karen",
    "Date": "February 4, 2023",
    "Email": "Kelley.karen@yahoo.com",
    "Phone": "5414291932",
    "Prayer Request": "Please pray for my ex-husband, Clark. He is 39 years old and has cirrhosis of the liver (and still drinks), schizophrenia, and an opiate addiction. I am worried that he will take his life, either intentionally or not. I cannot bear the weight of his illness. Please show me how I can best support him, please heal him and bring his mind out of the clutches of insanity and addiction. I don’t want my children to lose their father. You are God of the impossible. I cry out to you in desperation. "
  },
  {
    "Name": "Laura",
    "Date": "February 3, 2023",
    "Email": "sweetrainbowfire@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my online business to do better and be stable again and also please pray for my partner's mental health, thank you."
  },
  {
    "Name": "Roman",
    "Date": "February 3, 2023",
    "Email": "romans.8tw3nty8@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for our financial situation as a family emergency came out of no where, prayers that someone will purchase our vehicles to help our financial situation and everything that we are selling to make our ends meet. Thank you for all your prayers."
  },
  {
    "Name": "Brian",
    "Date": "February 3, 2023",
    "Email": "tepokna@gmail.com",
    "Phone": "",
    "Prayer Request": "Kindly asking prayers for my family and myself, that we may have God's continued grace, mercy and favor. Praying for our deliverance for 2023 in Jesus Mighty Name, thank you and God bless!"
  },
  {
    "Name": "Ami",
    "Date": "February 2, 2023",
    "Email": "planetmegan@gmail.com",
    "Phone": "6235120009",
    "Prayer Request": "I suffered a TBI(traumatic brain injury) in the end of 2019.  I've gone to numerous doctors, even ones out of state.  They know where my brain is injured, but no doctor knows how to even start healing it.  I can't listen to any music, I can read only very little      ( maybe a paragraph at a time) and I can't listen to recorded books or podcasts. I don't know what to do next."
  },
  {
    "Name": "Brenda Farley",
    "Date": "February 2, 2023",
    "Email": "farleybrenda776@gmail.com",
    "Phone": "2074936653",
    "Prayer Request": "Pray that radio stations play Gospel songs by Caroll and Brenda Farley."
  },
  {
    "Name": "Jason",
    "Date": "February 2, 2023",
    "Email": "jdegeorge2424@gmail.com",
    "Phone": "717-318-8131",
    "Prayer Request": "Horrible parasite infection & digestive problems which is becoming life threatening. 4 years of it & I've been praying a lot. I feel long worms moving in my left rib extending to my chest & throat. Im expecting a supernatural move of the Lord Jesus"
  },
  {
    "Name": "John and sylvia",
    "Date": "February 1, 2023",
    "Email": "feag777@gmail.com",
    "Phone": "2512094538",
    "Prayer Request": "God gave me a house and there is talk of this house being sold out from under me\nPray in agreement with me that God will make a way where there seems to be no way.\nAgree with me this house will be put in Sylvia,s name quickly."
  },
  {
    "Name": "Anonymous",
    "Date": "February 1, 2023",
    "Email": "dulamabhilashrao@gmail.com",
    "Phone": "",
    "Prayer Request": "Hi.. I am 36 years old , married and blessed with 2 sons . I am well educated and have 11 years of experience, currently i am unemployed and  I am financially unstable and if these continues in future I may end up in deep depression and severe financial Crisis.\n\nPlease pray for me for a Greatest career and abundance wealth so that I can help the needy as well.\n\nAmen."
  },
  {
    "Name": "Anonymous",
    "Date": "February 1, 2023",
    "Email": "shonscott5071@gmail.com",
    "Phone": "2532876278",
    "Prayer Request": "Praying for a reversal of decision on an apartment application that was denied. I pray that this appeal be reversed. May His mercy & grace fall upon me and i find favor with the management company over the apartment. "
  },
  {
    "Name": "Karen",
    "Date": "January 31, 2023",
    "Email": "nova72chevy@yahoo.comI",
    "Phone": "",
    "Prayer Request": "I am asking God for a place to live by the end of February. I must relocate by then. I am a loner and prefer to be by myself , I am a female and would like a somewhat roomy, quiet, safe place. I ask this in Jesus' name, amen"
  },
  {
    "Name": "MICHAEL T",
    "Date": "January 31, 2023",
    "Email": "mht7209@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my family. I have some kids that have stopped walking with the LORD. I am very concerned for my family. Please pray for my prodigal children that their spiritual eyes will be opened and they will take GOD seriously. "
  },
  {
    "Name": "Tatyana",
    "Date": "January 31, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\n\nImmensely grateful for your prayers about me and my family. I feel better and my shoulder is okay thanking to our loving Lord. On Sunday I was able to connect to my brother for a couple of minutes. The sound was broken. From the short pieces during our conversation, I understood that they are safe but have no electricity and no water. Glory to our merciful Lord that they are alive! My brother Michael and Angela are getting better, but I could not get any news about Eugene. He had to go back to work last week, but his wounds are not healed yet. Their roof leaks again. The most horrifying news is that Russians are advancing on the regions around my family. I am scared for their lives. Please continue your powerful prayers for Eugene's complete healing, his proper medical treatment, for Eugene's supervisor to assign him a light job, to get a better job, money to survive, and for all my family's health, safety, keep their apartment, electricity and water in it,(Michael, Angela, Eugene), and fix roof again, and for my fundraiser to help them, stop Russian attacks and peace in Ukraine. \nIt looks like Putin wants more territory worldwide. He claimed last week a huge chunk of Arctic Ocean seabed and sent spy ship to Hawaii recently and last year to Alaska. We have to pray for Ukraine's victory because it has abundant uranium reserves with which Russia could use to blackmail the whole world and start WW 3. \n\nYou and your families and church are always in my prayers. Abundant blessings and good health to all of you. \n\nHave a blessed week.\n\nTatyana.\n\n\nPrayer list: Tatyana, Michael, Angela, Eugene, (Andrew, Alex B, Alex N, Ivan-soldiers), Dmitry, Vova, Nataya, Nikolay.\n"
  },
  {
    "Name": "Anonymous",
    "Date": "January 31, 2023",
    "Email": "hjertesmerte@hotmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for me. I am a good person, in constant prayer and repentance. I wasn’t a good person in the past. I struggle with my place in this world, and it feels like it is coming to get me because I am afraid of opening the mail and have numerous of unpaid bills and unfulfilled duties. It is so hard to ask for help because I have been let down, betrayed and abused by those who were supposed to help me. I want to part with that past. I don’t want to fight for my rights and compensation. I deeply wish for heaven to provide for me, for in my suffering I found the love of our lord. All I want is to lovingly and joyfully carry out my responsibility as a survivor who has been rescued by guardian angels more than twice. Guardian angels and great mystery of God, please perform miracles for me again. I have forgiven everything because I see that I was given the merciful and glorious gifts of wisdom that wounds hold. But I am in constant agony over whether I am doing enough. I just want to be a loving person, live safely in peace and bring Christ’s light to the world. Help me. Help me now, for my heart is your loyal servant. As I pray as much for others and our global family as I do for myself, please send a multitude of blessings to those who have upheld me in prayer. Amen. Thank you. "
  },
  {
    "Name": "Michelle M",
    "Date": "January 31, 2023",
    "Email": "blessingsformichelle@gmail.com",
    "Phone": "2294018494",
    "Prayer Request": "Good morning. I desperately need prayers for True Healing and Forever Deliverance from cancer. I was first diagnosed August 1, 2020. Pray pray pray for me. "
  },
  {
    "Name": "Michelle M",
    "Date": "January 31, 2023",
    "Email": "blessingsformichelle@gmail.com",
    "Phone": "2294018494",
    "Prayer Request": "Hi My name is Michelle Massey. I am asking prayers to be released from the Superior Court system here in Georgia. I desire to move to Philadelphia Pennsylvania permanently. Please pray for me to have favor with my judge, to be released. Thank you God bless you "
  },
  {
    "Name": "JENNIFER S",
    "Date": "January 31, 2023",
    "Email": "jspitzer1960@gmail.com",
    "Phone": "7576027538",
    "Prayer Request": "Please pray that I have healing of bladder and fatigue and that I feel alert and full of energy ijnip "
  },
  {
    "Name": "Anonymous",
    "Date": "January 30, 2023",
    "Email": "roberts.anthony219@gmail.com",
    "Phone": "",
    "Prayer Request": "blood of Jesus Christ prayer request\n\nPowerful prayer protection for 2023 and beyond\nAnd for god to use me to spread his word to millions and exstend my life for that purpose for many more years.\n\nI’m believing god for:\n\nSalvation for me and whole family & those lost\n& don’t know Jesus Christ.\nRepentance to god and all I may have misled unwaringly.\nProtection & God keep his warrior angels round me consistently through 2023 and beyond.\nProtection Finances Marriage Kids House Car Healing Stop smoking and drinking\nFor god to move me so he can use me. New friends Be placed in the right ministry Restoration\nCareer Good success Good health Protection Against enemies\nObedience to gods word Stop being mistreated\nDeliverance from my will to do the will of Jesus christ.\n\nI need strong powerful prayer because the enemy has been trying to destroy my character and try to take my life from god using me. I need gods covering over my life stronger than ever before for 2023 and beyond.\n\nPrayer against enemies and the spirit of witchcraft, and it’s attachment  from my life and family life and lineage. I need god to destroy these works of the enemy and darkness through prayer. In Jesus Christ name.\n\nExceedingly abundantly above all can ask or think.\n\nThank you in Jesus Christ name.\n\nSaferty and protection from those trying to take my life and plot against me.\n\nI need to move and get out of my FL area right now because some one is plotting against me and my demise and performing witchcraft.\n\nI need powerful covering at night and day with powerful god's angels.\n\nPeople are plotting my demise.\n\nAlso I need a car to get away and place to stay.\n\nI need powerful angelic covering.\n\n\n\n"
  },
  {
    "Name": "D.H",
    "Date": "January 30, 2023",
    "Email": "Marketing.sales.group@gmail.com",
    "Phone": "",
    "Prayer Request": "I am coming to you this morning suffering from anxiety , it is affecting my everyday life. It is hard on me and hard on my family. It has been hard for me to do for myself and my family. I am asking anyone who read this please pray for relief for me and my family.  To all those on this wall who needs prayer and all those praying for others my God bless you!"
  },
  {
    "Name": "Anonymous",
    "Date": "January 29, 2023",
    "Email": "josepht200@gmail.com",
    "Phone": "",
    "Prayer Request": "I prayed for my family to be able to get another car because the pervious car was having a lot of expensive engine trouble. We were fortunate to get another car which I am happy with, but my mother is just miserable and hateful about the car. Pray for peace and reconciliation in the famly over the vehicle. \n"
  },
  {
    "Name": "Anonymous",
    "Date": "January 29, 2023",
    "Email": "vze1pm3a@verizon.net",
    "Phone": "",
    "Prayer Request": "I am praying for a financial miracle and  God’s unprecedented favor.  I pray that God delivers me from depression, grief, loneliness, and anxiety, In Jesus name amen!"
  },
  {
    "Name": "Shashini",
    "Date": "January 29, 2023",
    "Email": "shashinichameli27@gmail.com",
    "Phone": "+94775119790",
    "Prayer Request": "Please pray for me to solve our serious financial problem and to have my ECT (Electroconvulsive Therapy) treatment properly, ASAP. Please pray for me to heal my mental illness."
  },
  {
    "Name": "Anonymous",
    "Date": "January 28, 2023",
    "Email": "spatton107212@gmail.com",
    "Phone": "931-446-5067",
    "Prayer Request": "Please pray for our son Kerigan. He was raised in church and has always loved the Lord. He is 23 and for the past few years befriended the wrong people which came with a huge struggle in his life and most recently he was with the wrong person while trying to help them with a ride home ended him in trouble because he was in the same car which can potentially ruin his life. Please pray that God will deliver Kerigan from this situation and bring him closer to our Lord and Savior more than ever and that God will intervene and all this will be dismissed so he can put this behind him. Give us strength as a family to help us deal with it along side our son. "
  },
  {
    "Name": "Matthew",
    "Date": "January 28, 2023",
    "Email": "darkeningmonkey@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray that my father would be guided by the Holy spirit to salvation."
  },
  {
    "Name": "Anonymous",
    "Date": "January 28, 2023",
    "Email": "smokinmama1952@hotmail.com",
    "Phone": "",
    "Prayer Request": "Pls. pray for me and my husband as we still have covid, we need a total and quick recovery, TY and God bless, Mary"
  },
  {
    "Name": "Karin",
    "Date": "January 28, 2023",
    "Email": "kaki75@hotmail.com",
    "Phone": "",
    "Prayer Request": "Please Father, even though someone tells me differently i still keep hope in a certain situation. Will You please show me how Harold truly feels towards me. And to talk to me about it. Please let me know if he is scared. Because i can lie to myself and also advise from others may give me a wrong perspective and i just need to know. Really know. Because right now i am hurting because of what others say about it. Please dont make your own interpretation on this prayer. I solely want to know this. So please no prayers about marriages/ spouses etc"
  },
  {
    "Name": "Brenda",
    "Date": "January 28, 2023",
    "Email": "farleybrenda776@gmail.com",
    "Phone": "2074936653",
    "Prayer Request": "Pray that radio stations play Gospel songs by Caroll and Brenda Farley."
  },
  {
    "Name": "Theo N",
    "Date": "January 27, 2023",
    "Email": "africanappartments@outlook.com",
    "Phone": "17174561584",
    "Prayer Request": "It's been a year since my relatives stored my Mini DV Tapes collection in their Car with their family memories in them. The Car and the Tapes were stolen on Jan 3rd 2022. To this very day, I did not come across the Tapes plus the guy that stole them. I need this Church site to please pray that I recover these memories in the mighty name of the Lord and his begotten son. Thank you in advance and Happy Holidays."
  },
  {
    "Name": "Ginger",
    "Date": "January 27, 2023",
    "Email": "gingerlynelle@yahoo.com",
    "Phone": "7086234006",
    "Prayer Request": "Pray for my boyfriend to get healed completely of his aortic stenosis, and his allergic reaction to amoxicillin."
  },
  {
    "Name": "Cynthia",
    "Date": "January 27, 2023",
    "Email": "civi611@iCloud.com",
    "Phone": "5308021100",
    "Prayer Request": "Please Dear Father in Heaven bless my Ryan Nicole with a miracle. She has a spinal injury due to an auto accident. She’s only 4. The most innocent loving sweet child. I thank you for all the progress she has made and that she and my daughter are alive. I love you. My request is that Ryan will walk again. Oh please I know all things are possible thru you Oh Lord. For you are the almighty. H"
  },
  {
    "Name": "Anonymous",
    "Date": "January 26, 2023",
    "Email": "Wbonzibilly@yahoo.com",
    "Phone": "916 688 3958",
    "Prayer Request": "Please pray for my wife, she has stage four cancer in her lungs, small intestines and liver, let the good lord touch her and heal her of this disease, In the name of Jesus Amen "
  },
  {
    "Name": "Anonymous",
    "Date": "January 26, 2023",
    "Email": "zrowellfryar117@yahoo.com",
    "Phone": "9103580872",
    "Prayer Request": "Please pray my husband of twenty years has decide to leave. He has negative influences around him and do not have positive Christian influence. Lord has showed he’s being attack spiritually. We have been battling for him day and night with prayer. I know for a fact witchcraft is being done from what the Lord showed me. Please join us in prayer for him to recognize and fight. Thank you and God bless."
  },
  {
    "Name": "bjb",
    "Date": "January 26, 2023",
    "Email": "bj@bjb.com",
    "Phone": "2144556195",
    "Prayer Request": "Urgent!  Carolyn has many illnesses and is in a nursing home.   PLEASE……PRAY… DILIGENTLY…in the HOLY SPIRIT For God to totally & permanently heal & deliver her from ALL oppression, restore her soul & BRING HER HOME NOW !! !         PLZ  PRAY!!!!!"
  },
  {
    "Name": "Abel",
    "Date": "January 26, 2023",
    "Email": "shiningmermaid@hotmail.com",
    "Phone": "1603928441",
    "Prayer Request": "Prayer for Christ to draw us out of this fiasco of my mother getting abused by a drug addict friend, being gaslighted, and riving the family apart for years. I already watched this for a lifetime, advising but now it's they get back together monthly for more messes. I need closure emotionally to know where safe and sound from any manipulation and pain."
  },
  {
    "Name": "Cynthia",
    "Date": "January 26, 2023",
    "Email": "civi611@iCloud.com",
    "Phone": "5308021100",
    "Prayer Request": "Dear Father God hear my prayer. I know I’m a sinner and don’t always practice my faith. I am so sorry for this. I want to thank you Dear Lord for all the progress so far with my grand daughter Ryan Nicole’s healing. Shes 4 years old. She’s a baby my Father , sweet, smart, loving and kind. Please Dear God bless my Ryan Nicole with a complete healing from head to toe.. Bless her with a miracle Dear Father. For you are the king, all things are possible thru you.  Make her walk once again. I ask this in the name of Jesus  Please oh please Amen. Thank you Lord I love you "
  },
  {
    "Name": "Anonymous",
    "Date": "January 26, 2023",
    "Email": "Kafumbarejoice@gmail.com",
    "Phone": "",
    "Prayer Request": "I am mentally ill and this disturbs the way I think I act like a child and when people are talking to me I just smile and laugh I am really stupid and people take advantage of me I am too quiet and timid and wherever I go I can't make friends please pray for me "
  },
  {
    "Name": "Anonymous",
    "Date": "January 25, 2023",
    "Email": "amconstantino828@yahoo.com",
    "Phone": "9175343225",
    "Prayer Request": "Lord , thank you for all the blessings . Today , am praying for the quick recovery of Luna our dog from meningitis. Heal her brain and membrane inflammation. Please no more seizures, vomits and teary eyes . We trust in your healing power. We ask this through Jesus Chris Amen "
  },
  {
    "Name": "Tammie D",
    "Date": "January 25, 2023",
    "Email": "h2lsweet@hotmail.com",
    "Phone": "2057906514",
    "Prayer Request": "My dad, Richard needs healing from diabetes. His legs swell and weep and get water blisters. He is weak and dizzy allot.  He has trouble walking and falls allot. Pray for complete healing! "
  },
  {
    "Name": "Chungie",
    "Date": "January 24, 2023",
    "Email": "savitrip@ccaeagles.org",
    "Phone": "",
    "Prayer Request": "Pray that God intervenes in our son Joshua's life and set him on the path of God's plan for him.  Josh calls on the Lord.  God heals his entire being in Jesus Christ's name, dissolves the tumor, balances his hormones, redeems, renews, heals his body, mind, heart, soul, thoughts, and emotions. God gives him a sound mind, clear thoughts.  God heals and redeems our relationship with our son. Josh continues in college, pass his classes and finds a job. He seeks counseling. God sets his feet on the path of righteousness. break all demonic strongholds of alcohol, self-harm, drugs, wrong thinking over him. For godly friends. He functions as a normal adult and sleeps at night."
  },
  {
    "Name": "Anonymous",
    "Date": "January 24, 2023",
    "Email": "mr58033@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray that God would help me make the right decisions about my job not let fear be an influencing factor. Pray for peace, wisdom and breakthrough!"
  },
  {
    "Name": "George A",
    "Date": "January 24, 2023",
    "Email": "G26lewis@yahoo.com",
    "Phone": "",
    "Prayer Request": "I have been having blood in my stool and would like prayer for it to stop and be healed"
  },
  {
    "Name": "Juvily A",
    "Date": "January 24, 2023",
    "Email": "Girlsaloudfan93@gmail.com",
    "Phone": "2035646746",
    "Prayer Request": "Please Pray for my mom Lyn, she has swollen lymph nodes and I’m worried hoping it’s not cancer  please pray she doesn’t have cancer related to blood, lymphatic and please pray that her anemia gets better. I love my mom so much please pray for her to be healthy and heal her emotionally physically mentally and spiritually "
  },
  {
    "Name": "Jessica K",
    "Date": "January 23, 2023",
    "Email": "Jeskaras@gmail.com",
    "Phone": "602-615-3731",
    "Prayer Request": "My mother Linda who is in her late 70s had emergency bowel obstruction surgery along with discovery of 2 hernias. She has been struggling to keep any food down and in pain. She needs prayer for strength and healing so she can return home."
  },
  {
    "Name": "Megan W",
    "Date": "January 23, 2023",
    "Email": "lizzy590077@gmail.com",
    "Phone": "",
    "Prayer Request": "I have recently taken a math test, which is the final of the quarter. This grade will be the deciding factor of whether or not I can stay in the advanced math class. I want to pass this test so I can continue to prove myself and challenge myself, and also so I won't make others angry and disappointed in me, including myself. Please pray that I will get at least a 76 on this test so that I can stay in the course. Thank you, God bless!"
  },
  {
    "Name": "Anonymous",
    "Date": "January 23, 2023",
    "Email": "angelahughes269@yahoo.com",
    "Phone": "5024087255",
    "Prayer Request": "Please pray for my mother Edna suffering from mental illness. Pray that the chains of oppression be released from her mind and body and that she be totally healed. Pray for restoration in every area of her life and to be delivered from addiction to alcohol and smoking. God grant her peace and deliverance in Jesus name. Also please pray for my brother Michael B Jr that he be healed from drug addiction and sexual immorality. Pray for salvation for my entire family in Jesus Name Amen"
  },
  {
    "Name": "Anonymous",
    "Date": "January 23, 2023",
    "Email": "Jandjmom23@yahoo.com",
    "Phone": "",
    "Prayer Request": "I pray in Jesus name with all my being for a financial blessing for my son Jasper. I pray for divine intervention. I pray that he is able to pay his college, the money he owes them. Amen"
  },
  {
    "Name": "Amber",
    "Date": "January 23, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "Dear Lord, May everyone have what they truly need, if it is patience, may they have patience, if it is insight, may they have insight, if it is safety, may they have safety, if it is food, medicine, money may they have it and Dear Lord please bless all the good people of the world, may their blessings multiply each and every time they choose to do something good. May their hearts overflow with joy and their years with happiness. Amen"
  },
  {
    "Name": "Anonymous",
    "Date": "January 22, 2023",
    "Email": "Jscott236@gmail.com",
    "Phone": "6025359993",
    "Prayer Request": "Pray that my son steps up at his job and doesn’t get laid off.\nHe is not wanting to work hard and doesn’t understand that he needs to show he is willing to pull his weight. \nAsk that he turns his heart back to God."
  },
  {
    "Name": "Zlata",
    "Date": "January 22, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "for Gods Will to be done in Alina P life and for her to be in His Will for her life in Jesus Mighty Name amen and for her to hear His Voice and follow His voice and for everything to be in her life according to His Will"
  },
  {
    "Name": "Jennifer C",
    "Date": "January 22, 2023",
    "Email": "theartofjcc@hotmail.com",
    "Phone": "",
    "Prayer Request": "I need strong prayers for my daughter Chloe she has been sick over a month and it will not resolve chest pain, bacterial infection,viral, a double ear infection ,bronchitis and she's been to the Dr twice and has had to work for financial reasons. She's been on 2 antibiotics and various medicines and has to  work ..please pray and keep her on your list"
  },
  {
    "Name": "Shaleem I.",
    "Date": "January 22, 2023",
    "Email": "shalirockxx@gmail.com",
    "Phone": "03009604757",
    "Prayer Request": "Please pray for my mother Teresa Charles health....her Blood pressure fluctuate... please pray for her normal blood pressure, diabetes and heart problem...also pray for her kidneys...i believe God will bless my mother with happy healthy and long life...in Jesus Name we pray...Amen."
  },
  {
    "Name": "Anonymous",
    "Date": "January 21, 2023",
    "Email": "tlynnpo@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray for my mom, Hope. She has an routine scan coming up. Please pray all is healthy and comes back normal. Prayers for good health for her!! Thank you so much!! \n"
  },
  {
    "Name": "Bill M",
    "Date": "January 21, 2023",
    "Email": "krymdawg@yahoo.com",
    "Phone": "6027397708",
    "Prayer Request": "Please play that Shirley is able to be moved to a different rehab facility and gets stronger so she can undergo surgery on her pancreas to remove her cancer. "
  },
  {
    "Name": "Bryan",
    "Date": "January 21, 2023",
    "Email": "bryannettles30@yahoo.com",
    "Phone": "3468166739",
    "Prayer Request": "Please pray for my nephew Jayden L to begin thinking positively, make better decisions, and improve both academically and behaviorally in school."
  },
  {
    "Name": "Jim K",
    "Date": "January 21, 2023",
    "Email": "jimkorger@gmail.com",
    "Phone": "6039431501",
    "Prayer Request": "  Please pray that God guides me to do as much volunteer work this year as possible."
  },
  {
    "Name": "AMAL",
    "Date": "January 20, 2023",
    "Email": "amalshades@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for me..\nI am in the brink of financial collapse.please pray for me to solve my financial crises.i lost my job and suffering a lot. Please pray for me.i need urgent money for sustaining.God is my only hope.God please forgive me,i am sorry for all my bad deeds.Please bless me with thy everlasting mercy.. please show thy mercy... please bless me with finances..i am asking you in the name of your begotten son Jesus Christ....\n\nAmen "
  },
  {
    "Name": "Jeremiah H.",
    "Date": "January 20, 2023",
    "Email": "triunion321@yahoo.com",
    "Phone": "7193305248",
    "Prayer Request": "Please pray that there would be peace and respect between me, my coworkers and my boss. Thanks"
  },
  {
    "Name": "Ruth T",
    "Date": "January 20, 2023",
    "Email": "missymissy1970@aol.com",
    "Phone": "19172680494",
    "Prayer Request": "I am going through a Spiritual Warfare, I need Prayer for deliverance from My enemies at work and my neighbors, Healing and Financial Blessings. Give me the Victory in Jesus Name. Amen\n"
  },
  {
    "Name": "Lisa",
    "Date": "January 20, 2023",
    "Email": "lalpert123@gmail.com",
    "Phone": "6023940028",
    "Prayer Request": "Father God I ask that you wrap your arms around Priscilla and provide all her needs.  Please make the pain be minimal for any tests she may need and you know what her needs are . Please provide her comfort."
  },
  {
    "Name": "Anonymous",
    "Date": "January 20, 2023",
    "Email": "Vio.valley@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my grand baby. I didn’t realize and had an oral cold sore flare up barely beginning and kissed the baby’s cheek. It was my first day but I realized after that it was a cold sore forming. I quickly cleaned her cheek with a baby wipe, but I am paranoid and been researching and scaring myself to death. I have been praying hard and gotten on my knees and pray babygirl does not have a flare up. Please pray my granddaughter did not catch the virus. I am worried sick and so stressed out. Amen and thank you for your time and prayers. "
  },
  {
    "Name": "Alicia",
    "Date": "January 20, 2023",
    "Email": "3434dat@gmail.com",
    "Phone": "8054541983",
    "Prayer Request": "Please pray for my relationship with Jose to be restored and strengthen please I’m going through very hard times  ask god to bless me I need his blessing upon my life and relationship right now I’m going through a lot of emotional pain "
  },
  {
    "Name": "Anonymous",
    "Date": "January 19, 2023",
    "Email": "jpszita@outlook.com",
    "Phone": "",
    "Prayer Request": "I'm a father of 3 boys and a husband. Recently had eye surgery, I haven't had income for a while and suffering of stress & anxiety (rough couple of years). PLEASE pray for my recovery, my overall health and ask Jesus to put me back on my feet to enjoy life again. I THANK YOU IN ADVANCE FROM THE BOTTOM OF MY HEART. God bless you, in Jesus name, amen"
  },
  {
    "Name": "Susan Curtis",
    "Date": "January 19, 2023",
    "Email": "twosteprns@msn.com",
    "Phone": "6027998317",
    "Prayer Request": "A woman I have been ministering to would like prayer to feel more love towards her husband. She is asking that any and all walls that stand between them will be reaveled.  As they struggle to get over or around them, I pray the walls will crumble like the walls of Jericho. May they each allow God to lead them. Thank you.\n"
  },
  {
    "Name": "Erin",
    "Date": "January 19, 2023",
    "Email": "erinps658@gmail.com",
    "Phone": "7312173618",
    "Prayer Request": "I am not even sure if this is depression or finances. I moved into a new home with the intention of being with my disabled son. There were many hidden issues that are structural and unsafe. They're making me go through a court battle to get this fixed. I'm running out of money and I don't have a job because I have hurt my back in the process of all this. I need a good job, with insurance, and I need a miracle on this house. My son needs me. I have faith that God will direct me. "
  },
  {
    "Name": "Susan Curtis",
    "Date": "January 19, 2023",
    "Email": "twosteprns@msn.com",
    "Phone": "6027998317",
    "Prayer Request": "Received this from Patricia as a follow-up to previous request for her precious son. \n\nCan you please put our 4yr old Bryson Welch  back in the prayer chain this week through to the following week.\n My husband and I are traveling 22 hours right now with our 2 toddlers, to Memphis Tennessee for Brysons brain surgery. Brysons seizures have been out of control and his brain tumor is causing problems. \nHe’s being admitted for testing under anesthesia for two days January 23-24, and Brain surgery followed is January 25 th, then recovery is following. \nAnd then we’ll have a long drive back home. \nPlease pray for Brysons surgery to be safe and successful... And that his pain will be not so painful to too long. \n\nThank you in advance. "
  },
  {
    "Name": "Brenda Farley",
    "Date": "January 19, 2023",
    "Email": "farleybrenda776@gmail.com",
    "Phone": "2074936653",
    "Prayer Request": "Pray that radio stations play Gospel songs by Caroll and Brenda Farley and that people listen to them"
  },
  {
    "Name": "Pam",
    "Date": "January 19, 2023",
    "Email": "pammyj.pa@gmail.com",
    "Phone": "4193785075",
    "Prayer Request": "Please pray that I am able to get the injections and surgery in my spine and hip, that workers comp agrees to add these issues to my claim. Thank you."
  },
  {
    "Name": "Anonymous",
    "Date": "January 18, 2023",
    "Email": "truettd@mail.com",
    "Phone": "",
    "Prayer Request": "For Israel and Family, Please pray Blessings, Protection, Healing, God's Presence, Love, Grace, Forgiveness, Mercy, and everything else for My Son, Wife, and Me.  The family is having a hard time working out things due to the spiritual situation of things and the son is also feeling sick as of today with breathing and coughing issues.  Thank you for your prayers, Blessings, and Love"
  },
  {
    "Name": "Anonymous",
    "Date": "January 18, 2023",
    "Email": "jcgalistan@gmail.com",
    "Phone": "82280619",
    "Prayer Request": "I am giving my husband a last chance before making a decision if I want a divorce. He has been mixing with ungodly who is leading him astray and his heart is turning cold for God. I do not know how to turn him back. Please pray that I will make a wise decision and God intervention upon his life. Thank you"
  },
  {
    "Name": "Anonymous",
    "Date": "January 18, 2023",
    "Email": "vikisam231@gmail.com",
    "Phone": "09769170297",
    "Prayer Request": "Please pray for my mother suffering from heavy diabetes, blood pressure, pneumonia, cholesterol. From last 10 days she has stopped eating and from last 5 days not taking proper medicines. Please pray for my mother's speedy recovery . strong feeling is coming that  some evil spirits and forces want to destroy my mother I have a strong feeling. Please pray for my mother's speedy recovery "
  },
  {
    "Name": "Brandi",
    "Date": "January 17, 2023",
    "Email": "Theereiterfamily@gmail.com",
    "Phone": "",
    "Prayer Request": "Pray I can joyfully lose 40 lbs and keep it off and be happier, please also pray for my marriage in Jesus Name, Amen.  Thank You Jesus. "
  },
  {
    "Name": "Tatyana",
    "Date": "January 17, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\n\nImmensely grateful for your prayers for my nephew Eugene and family in Ukraine.\nSevere bombings were in Dnipro on Saturday killing 44 people and injuring dozens. Thanking to God, my family is alive and Eugene is home now and has to go to the doctor to change dressings on his wounds every day. Michael and Angela had to pay for Eugene's surgery. It was expensive, but Eugene can keep his job now. Hopefully, they will be able to repay the money they borrowed when Eugene will get back to work. Please continue your powerful prayers for Eugene's complete healing, his proper medical treatment, for money to survive, and for all my family's health, safety, keep their apartment (Michael, Angela, Eugene), for my fundraiser to help them, and peace in Ukraine. \n\nPraying for you and your families all the time. Millions of blessings to all of you.\n\nHave a blessed week.\nTatyana.\n\nPrayer list: Tatyana, Michael, Angela, Eugene, (Andrew, Alex B, Alex N, Ivan-soldiers), Dmitry, Nataya, Nikolay.\n"
  },
  {
    "Name": "Michelle",
    "Date": "January 17, 2023",
    "Email": "michellemlozano@gmail.com",
    "Phone": "6026861618",
    "Prayer Request": "Please pray for God to heal my broken heart. I’ve suffered so much loss and grief in the last 18 months. It started with a divorce resulting from my husbands affair. It felt unfair to give up 50% of my time with my then 5 year old daughter. Our home was sold, along with everything we owned. During my move, my dog of 15 years passed away and last November my father, who was my best friend, passed away unexpectedly. This morning, I woke up to the news that my boss, who was also a mentor and friend, passed away also unexpectedly. This also has me worried about what to expect with my job. I was once so strong, supporting others with a smile, but I’m tired and weak. I don’t know how to begin healing anymore. I find myself angrier and more bitter with less positivity everyday."
  },
  {
    "Name": "Anonymous",
    "Date": "January 17, 2023",
    "Email": "Wbonzibilly@yahoo.com",
    "Phone": "916 688 3958",
    "Prayer Request": "Please pray for my wife, she has stage four cancer in her lungs, small intestines and liver, let the good lord touch her and heal her of this disease, In the name of Jesus Amen "
  },
  {
    "Name": "Anonymous",
    "Date": "January 17, 2023",
    "Email": "monserratlay55@gmail.com",
    "Phone": "6024874338",
    "Prayer Request": "Please pray that our financial gets better. My husband worried so much if we going make it. The enemy stop telling lies to my husband. My husband can enjoy his life with his wife me and his kids and dogs."
  },
  {
    "Name": "Layra B",
    "Date": "January 17, 2023",
    "Email": "monserratlay55@gmail.com",
    "Phone": "6024874338",
    "Prayer Request": "Please pray for my husband that he is struggling right with his depression, anxiety. He can go back his priorities Lord Jesus Christ to have relationship and also read the Bible more. His priorities can be more closer relationship with Lord Jesus Christ and his wife and his kids and dogs. My husband can focus on more Lord Jesus Christ and his wife "
  },
  {
    "Name": "Anonymous",
    "Date": "January 17, 2023",
    "Email": "jngriesdorn@gmail.com",
    "Phone": "",
    "Prayer Request": "For my finances to take a major positive turn ASAP as I have been praying for years and the stress has taken a major toll on my mental, physical, emotional & spiritual well-being and I have been feeling as if I have been in a never-ending living hell for years. "
  },
  {
    "Name": "Anonymous",
    "Date": "January 16, 2023",
    "Email": "Lizburpee@gmail.com",
    "Phone": "6032387158",
    "Prayer Request": "Please pray for NF.He goes to a Christian school but,he is doing basketball practice at a regular school.He needs help healing his OCD,anxiety,porn,last and depression.Please heal him of these afflictions.Cast out demons,spirits and put a hedge of protection around him.Let angels protect him.Thank you.God bless."
  },
  {
    "Name": "Anonymous",
    "Date": "January 16, 2023",
    "Email": "josiepie74@yahoo.com",
    "Phone": "9494138072",
    "Prayer Request": "Dear Lord,\nI pray for Financial help regarding my financial responsibilities and cc debt, I also incurred hospital bills that I need to pay, another also I hope I dont need to pay back EDD for the payment they did when I get lay off from my job last \n2020, this is most that I am worried about since I dont know why I need to pay back when 2020 its the most hardest time of my life and nobody helps during that time and I pray please Lord have mercy on me and help me for this year to pay my for my finances, This I pray for in the name of Jesus my Lord and Savior.\nAmen"
  },
  {
    "Name": "Gloria B",
    "Date": "January 16, 2023",
    "Email": "Gloriaba@yahoo.com",
    "Phone": "7708952642",
    "Prayer Request": "Lord Jesus please I need encouragement, joy, peace, we are getting older,no family in the state, and I am worry if something happen to us. Please bring us friendly caring ,christian, neighbors, we do not have anyone, what I called garage door up and garage door down. .Lord Jesus I place our neighborhood in your hands. Amen"
  },
  {
    "Name": "Jennifer S",
    "Date": "January 16, 2023",
    "Email": "SPITZERH@AOL.COM",
    "Phone": "7576027538",
    "Prayer Request": "Please pray that I have energy strength protection favor great health do an excellent job it's not busy at work today and tonight and I can go to the store a few times ijnip amen "
  },
  {
    "Name": "Taniqua",
    "Date": "January 16, 2023",
    "Email": "taniquaboyd09@gmail.com",
    "Phone": "",
    "Prayer Request": "I pray that there are no shootings, fights, or killing at the Martin Luther King parade. I pray that it’s peaceful. I pray that no shootings or killings will happen at all here in Tulsa for a while. Wrap you angels around the parade and city. In Jesus name amen!"
  },
  {
    "Name": "Taniqua",
    "Date": "January 16, 2023",
    "Email": "taniquaboyd09@gmail.com",
    "Phone": "",
    "Prayer Request": "I am praying for Tywan A Sr. I pray that the streets release their grip from him. I pray that he leave his old friends alone. I pray that he run back to you. I pray he finds a legal job and get himself together. Lord break these old generational curses from him. Please keep him safe and protected and your angels wrapped around him. In Jesus name amen"
  },
  {
    "Name": "Anonymous",
    "Date": "January 15, 2023",
    "Email": "hghim0206@gmail.com",
    "Phone": "9299903140",
    "Prayer Request": "Please pray for my daughter Janice. Her boss, Randi is giving her a very hard time and has been continuing to harass her relentlessly every single day. Please pray for God’s protection over her; that the blood of Jesus Christ will cover her from head to toe. Please protect her against all evil words and actions that Randi tries to throw at her. I pray God will protect her and fight for her. Let no evil thing touch her. Please block all negativity and evil from Randi. Please give my daughter peace."
  },
  {
    "Name": "Wanda",
    "Date": "January 15, 2023",
    "Email": "wandamintz932@gmail.com",
    "Phone": "9102942111",
    "Prayer Request": "Please pray for my 2 sons Jesse and Matthew, Matthew needs salvation and Jesse needs a restoration he left a homosexual relationship and I had prayed that he would get his life in order but he has went back  and now I feel broken "
  },
  {
    "Name": "Nancy S",
    "Date": "January 15, 2023",
    "Email": "nlsteffen.ns@gmail.com",
    "Phone": "6027179602",
    "Prayer Request": "Please pray for my nephew, Kyle E, who was hit by a car and sustained numerous injuries. Fractures:  Neck, pelvis, knees, legs.  Torn ligaments around knees, snapped tendon in lower leg, shoulder dislocation and bruised lung. Thank you for your faithfulness in prayer!! God bless you!!!"
  },
  {
    "Name": "Anonymous",
    "Date": "January 14, 2023",
    "Email": "taniquaboyd09@gmail.com",
    "Phone": "",
    "Prayer Request": "Lord I pray for Tywan A. His friends always pull them in their messes. They always risk his life and freedom. I pray that he break away from everyone that mean him no good and turn towards you. Remove the anger and hatred out his heart and calm his spirit before he do something crazy. In Jesus name amen!"
  },
  {
    "Name": "Mya R",
    "Date": "January 13, 2023",
    "Email": "genesis8269@gmail.com",
    "Phone": "4243169557",
    "Prayer Request": "Please pray for my heart. My doctors can’t figure out what’s wrong with my heart. The pain is so bad … "
  },
  {
    "Name": "Judy T",
    "Date": "January 13, 2023",
    "Email": "tolley.judy727@gmail.com",
    "Phone": "4232977526",
    "Prayer Request": "Please pray for my son Leo. He is currently in a rehab facility and he is doing well. He will be released on January 25. He needs to transition into a Sober Living House. There are very few beds available but he has an interview on Sunday January 15 at 8:00 pm. \n\nPlease pray Gods Blessings over Leo. He is a good kid.  He was abused by his father and started using drugs and alcohol at a young age. He has lost him home and most of his family. He was baptized a few months ago and I know he would not be alive without Gods grace. Please pray he is accepted to this Sober Living House. Please pray Gods Blessings over him. "
  },
  {
    "Name": "Amber",
    "Date": "January 13, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "Heavenly Father, I am so blessed to be Your child, and that I can call You “Abba,” for You are my loving Daddy! My heart overflows with gratitude. You have made me a partaker of Your divine nature, and Your love for me is so wide, so deep – it is beyond my comprehension. May the truth of my identity in You sink deep into my psyche, and impact my relationship with others. Dear Loving Father, may I love others as You have loved me, with compassion and care. Amen.\nPrayer for Emotional Health to Give and Receive Love\nHelp Me Love Well Prayer\nHeal My Heart Prayer\nPrayer for a Husband\nNot for the Wrong Reasons Prayer\nWhile I Wait Prayer\n"
  },
  {
    "Name": "julie",
    "Date": "January 13, 2023",
    "Email": "olgasundin@yahoo.com",
    "Phone": "",
    "Prayer Request": "my dad is in the icu and his heart keeps stopping along with other severe ailments. please pray for his survival and full restoration and healing"
  },
  {
    "Name": "Jennifer Followwill",
    "Date": "January 13, 2023",
    "Email": "jennifer.followwill@gmail.com",
    "Phone": "6024816136",
    "Prayer Request": "My dad Bob F is on his way to Thunderbird hospital for more treatment related to blood clots and blood issues. He is very overwhelmed as is the rest of his family. Thank you for your prayers. "
  },
  {
    "Name": "Zlata",
    "Date": "January 12, 2023",
    "Email": "zlataaaya@gmail.com",
    "Phone": "",
    "Prayer Request": "asking for prayers of agreement\nHeavenly Father we humbly come to You and asking You to set Alina free from any dark spirits and spirits of fear in the Name of the Father and the Son and the Holy Spirit amen and for the outpouring of the Holy Spirit all over her life amen"
  },
  {
    "Name": "Timothy",
    "Date": "January 12, 2023",
    "Email": "timothyyoung32@yahoo.com",
    "Phone": "2052303972",
    "Prayer Request": "Urgent financial miracle for pastor Tim. God's wisdom favor"
  },
  {
    "Name": "Amber",
    "Date": "January 12, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "A prayer for a relationship with a specific person\n\nI have a crush on a guy at my church and I want to become friends with him. Right now he doesn't speak to me. He speaks to anyone and everyone else who is not me. I probably am not ready for a romantic relationship but at the very least small talk or a friendship would be nice. \n\nGive me wisdom, and control my desires, Oh Lord. I love this person, but I understand that you know the person more than I do. Guide me to a man who fears You and is filled with Your Spirit and one who will love me with Your love. \n\nThank you, Lord. Amen"
  },
  {
    "Name": "Amber",
    "Date": "January 12, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "A prayer for forgiveness of others who hurt me\n\nDear Lord, search my heart. Reveal to me any remaining burs of hurt where I have attempted to forgive apart from You. I pray You would cover these hurts in Your healing grace, and through Your strength, empower me to forgive others as wholly and completely as You first forgave me. \n\nIn Jesus' Name, Amen."
  },
  {
    "Name": "Amber",
    "Date": "January 12, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "Prayer for Forgiveness and Cleansing For Me\n\nJesus, as I ask for forgiveness from you, I ask that you would cleanse me with hyssop and make me pure. Sanctification is not an easy process but I want to become more like you, Lord. \n\nThank You. Amen."
  },
  {
    "Name": "Amber",
    "Date": "January 12, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "Prayer for Forgiveness When Someone Hurt Me\n\nHeavenly Father, thank You for forgiving me and bringing me back into relationship with You. Thank You for sending Your Son to die on the cross to show us the true meaning of forgiveness. Help me to show that same forgiveness to others, so they can see You living in me. \n\nIn Jesus’ Name, Amen. "
  },
  {
    "Name": "Amber",
    "Date": "January 12, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "Prayer for Forgiveness during Intense Anger For Me\n\nDear Lord, please forgive me for harboring anger. Equip me with a supernatural ability to forgive those who have hurt me. Guard my heart when old emotions threaten to surface. Strip my heart of anger and replace it with joy. \n\nIn Jesus' name, Amen. "
  },
  {
    "Name": "Amber",
    "Date": "January 12, 2023",
    "Email": "Violinhi@gmail.com",
    "Phone": "",
    "Prayer Request": "Prayer for Forgiveness and Rebuking Resentment For Me\n\nDear heavenly Father, oh how our hearts struggle to forgive wholly and fully. We thank You for demonstrating such forgiveness by graciously extending it to us. Help us forgive freely and let go of bitterness, and grant us the strength to trust Your way is best.\n\nIn Jesus’ Name, Amen. "
  },
  {
    "Name": "William",
    "Date": "January 12, 2023",
    "Email": "Soulsteelsoldierx4@icloud.com",
    "Phone": "",
    "Prayer Request": "My prayer request is for someone I love and care for dearly. Her name is Sofia and she is in dire need of prayer. She walks within a fallen world not knowing its pitfalls. I don’t want to loser her,  she’s very important to me. So I’m asking for prayers for her safety, and ultimately her salvation. -please- prayer is all I have left so ANY help would be a blessing. Thank you"
  },
  {
    "Name": "Layra B",
    "Date": "January 11, 2023",
    "Email": "monserratlay55@gmail.com",
    "Phone": "6024874338",
    "Prayer Request": "Please pray for my husband that he can stop worrying about his family problems. That's he can focus on  Lord Jesus Christ and his wife and his kids and dogs.  He can pay more attention to me his wife. My husband can have peaceful mind "
  },
  {
    "Name": "Matt",
    "Date": "January 11, 2023",
    "Email": "dontmesswithbigmama@gmail.com",
    "Phone": "6823720928",
    "Prayer Request": "I'm having breathing problems, when i breathe i can only get half air full, frequently have to take deep breathes. Please pray my lungs would be healed, i've prayed across the web but it seems nothing is being healed. Please keep me in prayers. "
  },
  {
    "Name": "Karen",
    "Date": "January 10, 2023",
    "Email": "nova72chevy@yahoo.com",
    "Phone": "",
    "Prayer Request": "I am desperate to find a place to live before I am evicted. I  am single with a cat. I want a quiet , roomy place to call home. I can't be in a tiny little apartment for fear of  everything closing in on me. I have to find something very very soon or I will be living in my vehicle. I am an elderly female and I will be afraid to be outside by myself. Fear of being raped or worse."
  },
  {
    "Name": "Tom M",
    "Date": "January 10, 2023",
    "Email": "TomOzzy123@icloud.com",
    "Phone": "3303383336",
    "Prayer Request": "I had a colonoscopy yesterday, and they found one polyp.  Please pray that the biopsy comes back fine.  In Jesus' Name.  Amen."
  },
  {
    "Name": "Tatyana",
    "Date": "January 10, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear friends,\n\nThank you from all my heart for praying for my nephew Eugene in Ukraine and for my family and me. After the surgery on his low jaw, he has 3 tubes in the bottom of the left part of his law jaw to drain pus. Also pus is coming out of the wound in his mouth which helps to reduce the swelling. Now he can breath through the nose and swallow; thus, the feeding tube and pipe in this throat were removed today. Very grateful to our merciful God for His goodness and saving Eugene's life. \n\nNEW PROBLEM: the surgery supposed to be free, but now doctor asks for a lot of money or he will not sign Eugene's medical leave without which Eugene will lose his job. Please continue your powerful prayers for Eugene's complete healing, his proper medical treatment and the surgery free of charge, and for all my family's health and safety (Michael, Angela, Eugene), and peace in Ukraine. \n\nMy brother Michael is in a verge of loosing his apartment to the criminals. They threatened to hurt him if he does not give up his apartment or go to police. There are no apartments available because refugees took everything. Michael, Angela, and Eugene can't live on a street. It's freezing -- 15F outside. Please pray for God to intervene and free Michael from attackers and Michael and his family keep the apartment. I am completely shocked and terrified of what is going on now in Ukraine. A lot of civilian people are out of work because of war and try to make a living by attacking others. It's outrageous. I am devastated and in horrible pain.\n\nMay God bless you with every possible blessing abundantly, above, and beyond your highest expectations. You, your family, and church are in my daily prayers.\n\nHave a blessed week, my dear friends.\nTatyana."
  },
  {
    "Name": "Shaun and Brandi H.",
    "Date": "January 10, 2023",
    "Email": "rsbnnc@msn.com",
    "Phone": "7046995781",
    "Prayer Request": "Please pray that the builder of our new house  do the right things as he has promised. We are living with toxic algae now harmful to us and our dogs. Please have the case reopened. We are drained emotionally and financially because of this. Please pray to have it segment aired again. We have lost everything and so many miscarriages due to our stress. In Jesus Name Amen."
  },
  {
    "Name": "Anonymous",
    "Date": "January 9, 2023",
    "Email": "mwpi@rushmore.com",
    "Phone": "6054300014",
    "Prayer Request": "Pray my 2 nephews and their wives are committed to having their kids in Evangelical Based Christian Schools.  Also, pray they have the needed finances to pay for private school education.  "
  },
  {
    "Name": "Lori D",
    "Date": "January 9, 2023",
    "Email": "victorianera1@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my cats Logan and Summer. They have cancer. Please pray that God removes the cancer and gives them a complete cancer free healing. Thank you and God bless all of you."
  },
  {
    "Name": "Johnnie",
    "Date": "January 9, 2023",
    "Email": "roneisha2006@hotmail.com",
    "Phone": "",
    "Prayer Request": "please pray for my grandma Johnnie she may possibly have sepsis please pray for full recovery and that she come home soon and have no side effects this is her 7th hospitalization please pray for full recovery and her heart rate and kidney functions to stabilize in the name of Jesus"
  },
  {
    "Name": "daniel c",
    "Date": "January 9, 2023",
    "Email": "dcahill2001@yahoo.com",
    "Phone": "",
    "Prayer Request": "Hi pastor and all my wonderful brothers and sisters at the Pure Heart church!Please say a prayer for me i am saved yet homeless at 76 the warfare is constant leaving me exhausted from fighting but i know your prayers will help me prevail!GOD bless you richly  brother Danny   1/9/23"
  },
  {
    "Name": "Sister Ha-yeong Shin",
    "Date": "January 9, 2023",
    "Email": "slh7@protonmail.com",
    "Phone": "2053012665",
    "Prayer Request": "Please pray the following for me, my family, and for all of you. \n\n1. Please send us plenty of workers for the harvest that Jesus talked about, that is, his angels to eliminate those among us who deceive and causes sin and knock us down and let what Jesus seek to gather be gathered. \n\n\"The harvesters are angels.” \nMatthew 13:39 NIV\n\n “He told them, “The harvest is plentiful, but the workers are few. Ask the Lord of the harvest, therefore, to send out workers into his harvest field.” \nLuke 10:2 NIV\n\n“I will tell the harvesters: First collect the weeds and tie them in bundles to be burned; then gather the wheat and bring it into my barn.’ ””\nMatthew 13:30 NIV\n\n\n2. Help all of us keep the commandments according to the will of Jesus Christ and let God’s promised kingdom come. \n\n\n3. Pray for Jesus Christ to reveal to each of us the work of Father God and for that will to be done perfectly and holy.\n\n\n4. Let all of us worship Father God in the Spirit and in truth but let us worship not according to a person’s will but solely by the will intended by Jesus."
  },
  {
    "Name": "LJ",
    "Date": "January 8, 2023",
    "Email": "twjtwj56@gmail.com",
    "Phone": "",
    "Prayer Request": "Praying a new full time job opening prevails immediately for Leland. Father God I declare divine breakthroughs, favor & financial blessings be provided for Leland to obtain/maintain steady full time employment, housing & transportation needs. Praying for Gods protection, good health, well being and encouragement is with Leland daily. "
  },
  {
    "Name": "Anonymous",
    "Date": "January 8, 2023",
    "Email": "Kristin.Perkins@coastaltransport.com",
    "Phone": "6238267525",
    "Prayer Request": "A work friend is terminally ill. He has become spiritual over the years. Please pray for his Receiving of Christ. Please pray for me, if my guidance is requested. Thank you. "
  },
  {
    "Name": "Rock",
    "Date": "January 8, 2023",
    "Email": "rock07170209@gmail.com",
    "Phone": "",
    "Prayer Request": "Dear Lord, my son is suffering from bad cough, please heal him and make the cough stop soonest, amen."
  },
  {
    "Name": "Ha-yeong S.",
    "Date": "January 8, 2023",
    "Email": "slh7@protonmail.com",
    "Phone": "2053012665",
    "Prayer Request": "Lord, reveal the work of God the Father to me, my people(Ha-young, Ye-young, Ui-seop, Jung-won, Hye-ok, Yul-bin, Suzy, Eun-tae, In-sook, Im-hak, Tan-ae), and to all who read it and pray, and let us know that the Father is in the Son Jesus and that Jesus is in the Father. The will of the true God, who knows all our needs, transcends our personal will. And that all of us will clearly see the Glory that God the Father gave to the Son because He loved His Son before the foundation of the world. Let Jesus Christ directly reveal the name of God the Father to us and see His glory. I Pray that all our glory be truly dedicated to your Son, Jesus Christ. And that we all shomer mitzvot regarding his commandments(keep his commandments) without failure. May God make possible what is impossible for man."
  },
  {
    "Name": "Anna C",
    "Date": "January 7, 2023",
    "Email": "carranza.anna@yahoo.com",
    "Phone": "9728557251",
    "Prayer Request": "Hello, I am a caregiver and my patient of 9 years passed away. I'm emotionally and financially stressed. Please pray that I seek employment soon to help me with my finances, so that I can be able to provide for my son and household needs. Thank you! "
  },
  {
    "Name": "Jennifer S",
    "Date": "January 7, 2023",
    "Email": "SPITZERH@AOL.COM",
    "Phone": "7576027538",
    "Prayer Request": "Please pray that I am not sick tomorrow and that I can do an excellent job with no mistakes or problems ijnip amen "
  },
  {
    "Name": "Anonymous",
    "Date": "January 7, 2023",
    "Email": "johnson.kurt19@gmail.com",
    "Phone": "505-220-6209",
    "Prayer Request": "I written before when I was having trouble with my ears. Thank you so much!\n\nMy name is Kurt from Albuquerque. I have a rare medical condition which you all have been praying for. I appreciate it, extremely! Monday morning, I had another blackout and I was out on the street. I woke up Monday afternoon in the er with a fractured skull, fractures in my face and fractures in my neck. We traced it back to my myoclonic epilepsy.  Also, praise for the good Samaritan who called 911. Thanks again for your prayers. I have to wear a neck brace for 8 weeks and see a few doctors. They put me on anti-seizer medication which my body couldn't handle so everyday is prayer because I have bleeding on my brain. Pray for diagnosis and treatment and God Bless! It could have been much worse. I guess my right knee caught some of the fall and then hit the left side of my head. It was not a direct hit to my nose or anything. (the odd thing about it is years ago I was diagnosed with frontal lobal syndrome. Well, if God works in mysterious ways, that would be it. All seriousness aside, I thank God for his blessings. We will see how it is doing in a few weeks.) Have a Blessed and Safe New Year. Thank you.   "
  },
  {
    "Name": "Lia Marie",
    "Date": "January 7, 2023",
    "Email": "Missmagicmajesty@gmail.com",
    "Phone": "9206297074",
    "Prayer Request": "please pray for me with your hands and my mom that we are freed from any negative things and sicknesses \nand that good things come to us ty"
  },
  {
    "Name": "Anonymous",
    "Date": "January 6, 2023",
    "Email": "amandakralisz@icloud.com",
    "Phone": "5867477772",
    "Prayer Request": "Prayer for total peace and release of any connections and unholy soul ties from a former relationship with Kyle.  I need God himself and all angel armies to protect me from his harassment and heal my life from all the harm he has caused me. \n\n"
  },
  {
    "Name": "Anonymous",
    "Date": "January 6, 2023",
    "Email": "amljw1027@gmail.com",
    "Phone": "0",
    "Prayer Request": ", Father, You knows how long I have waited a reconcilitation for me and him. God if you deign, please God soften and touch his heart for me. "
  },
  {
    "Name": "Ang",
    "Date": "January 5, 2023",
    "Email": "Chicadelrey@yahoo.com",
    "Phone": "5157180559",
    "Prayer Request": "Hi, my name is Ang. I'm 37, 26 weeks pregnant with my 1st child, & I'm going to be a single mother. Please for guidance for me."
  },
  {
    "Name": "Justin",
    "Date": "January 5, 2023",
    "Email": "Justin.addisonet@gmail.com",
    "Phone": "",
    "Prayer Request": "Please pray for my daughter, Lily (she will be 8 tomorrow). She had surgery almost 2 weeks ago and is  in bad pain still. No medicine will help. Thank you so much"
  },
  {
    "Name": "Kimi",
    "Date": "January 5, 2023",
    "Email": "kimifaz@yahoo.com",
    "Phone": "",
    "Prayer Request": "My parents live in Kansas and their Pastor and friend Don was just diagnosed with pancreatic cancer.  The doctors have given him 6 months (but of course that is not God's timing!) So please be praying for him and his wife Wanda that is disabled and depends on him to help her.  Their relationship with their daughter and son-in-law has been strained and reconciliation needs to happen before her father goes home to Jesus!  Thank you for your time and prayers!"
  },
  {
    "Name": "carol",
    "Date": "January 5, 2023",
    "Email": "nannyonthego@hotmail.com",
    "Phone": "4438058158",
    "Prayer Request": "Please pray for my friend Henry….He has been diagnosed with three different kinds of cancer which are hereditary….He is doing chemo as of now….Please pray the Chemo works and he goes in remission….He has a wife and family, pray for them also please."
  },
  {
    "Name": "Katherine",
    "Date": "January 4, 2023",
    "Email": "KatherineEstelle11@proton.me",
    "Phone": "706-428-4537",
    "Prayer Request": "Please pray that my friend Brandon stays in the light and remains grounded and rooted in light and love. Please pray that his  heart and finances are healed and that he sees God working in his life."
  },
  {
    "Name": "Diana H",
    "Date": "January 3, 2023",
    "Email": "family.hart.dg@gmail.com",
    "Phone": "0223880475",
    "Prayer Request": "Hello everyone,\n\nMay I ask you to please stand in agreement for my healing.\n\nInterstitial cystitis, fibroids in uterus, anemia, leaky blood brain barrier, central nervous system damage and in fight flight, auto-immune issues (mast cell activation syndrome), eyebrows falling out (alopecia), pelvic organs to receive a creative miracle due to botched surgery which has affected other organs. It would be most wonderful to receive a miracle from the top of my head to the soles of my feet :).\n\nI would very much appreciate your help.\n\nMany thanks"
  },
  {
    "Name": "Ashley",
    "Date": "January 3, 2023",
    "Email": "lionheartedrosa@gmail.com",
    "Phone": "(407) 707-2033",
    "Prayer Request": "My boyfriend Ben has to make the tough decision to be with myself or another woman, please give him the courage to choose and love me only."
  },
  {
    "Name": "Joshua",
    "Date": "January 3, 2023",
    "Email": "joshua.letterbox@gmail.com",
    "Phone": "",
    "Prayer Request": "Hello, last year a hot water bottle (freshly fulled) burst open onto my foot which has left nerves firing off and causing much pain. When I was 3 my dad dropped me near a boat and I hit my head on hard edge of boat which has caused lots of head injuiries. Also - I would like to stop biting my nails. Pls Pray for me. Thanks Joshua (10 yrs)"
  },
  {
    "Name": "Erin",
    "Date": "January 3, 2023",
    "Email": "seagreeneyes103@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray for me and my mom. We are saying goodbye to our 22 year old cat on Thursday. The sadness and grief will be overwhelming and crushing. Please pray our hearts & minds are protected & comforted completely so that we are not destroyed by this loss. I love my cat more than anything & I pray she’s soon at peace in Heaven. Please pray for us & for Kitty. I’m so afraid of the grief & coming home to an empty house. Please pray God wraps us all in His arms & keeps us safe from pain & suffering. "
  },
  {
    "Name": "Tatyana",
    "Date": "January 3, 2023",
    "Email": "tatyana.kor@yahoo.com",
    "Phone": "5593003324",
    "Prayer Request": "Dear  friends,\n \nThank you so very much for your powerful prayers for my family in Ukraine. My nephew Eugene is in intensive care there. He had an inflammation in his mouth and was misdiagnosed by the local doctor. As a result of medical mistreatment, the abscess in Eugene's mouth got severely swollen and closed his throat on January 1. The local hospital was unable to help and Eugene was taken to the regional center that had equipment to perform the surgery. The surgery went well, but now Eugene breathes through the pipe in his throat that was cut open to install the pipe. He is fed through the tube in his nose because cannot swallow. All his bottom jaw was cut up to operate the abscess. I was crying all day. I don't know how much more grief and sorrow I can possibly take. My fibromyalgia symptoms got aggravated and cased severe pain and fatigue. Please pray for Eugene's full recovery and finances for medications and proper medical treatment from knowledgeable doctors. Please continue supporting my family through this devastating situation during horrifying war.\n\nImmeasurably grateful for your kindness, care, and support. Praying for your and your loved ones wellness, safety, and success. Abundant blessings.\nPrayer list: Tatyana, Michael, Angela, Eugene, (Andrew, Alex B, Alex N, Ivan-soldiers), Dmitry, Nataya, Nikolay, safety, health, peace in Ukraine.\n\nTatyana.\n\n\n"
  },
  {
    "Name": "Anonymous",
    "Date": "January 3, 2023",
    "Email": "godrules86@gmail.com",
    "Phone": "9517325581",
    "Prayer Request": "Help us we are traumatized everyday by people in our mobile home park which we cannot move away from because we cannot afford to move God has us here for a reason because there's people that come to us and we pray with them inside our coach and we have Bible studies on Wednesdays and Sundays but there's people in this park that want to hurt us please help us we need to have our lives changed today spiritually more powerful thank you so much"
  },
  {
    "Name": "David P C",
    "Date": "January 3, 2023",
    "Email": "dcarroll304@aol.com",
    "Phone": "+1 01985075081",
    "Prayer Request": "Pray for the soul of James C\nWe love and miss you so much every day your forever in our heart's to stay we love you so much. R.I.P."
  },
  {
    "Name": "Anonymous",
    "Date": "January 3, 2023",
    "Email": "Areasalesmanager7@gmail.com",
    "Phone": "",
    "Prayer Request": "Lord Keep me, take worry from my mind. \n\nProtect my brother in prison. Bring him home safe and whole\nSave and heal aunt, bring her home from hospital \nHeal uncle of all organ failures and body not functioning the natural way.\nHeal cousin from surgery\nHeal my husband and improve his finances \nHeal my elbow and hand.\n\nAmen"
  },
  {
    "Name": "Rose",
    "Date": "January 2, 2023",
    "Email": "rosebyass1@gmail.com",
    "Phone": "0400218354",
    "Prayer Request": "Dear God\nThank you for bringing Darren into my life, I am grateful that the love you share with me is the love I share with Darren. Darren and I separated two weeks ago and I miss him God. \nPlease forgive me for the harsh words I spoke to Darren and please let Darren know I forgive him for his words and actions. \nThank you for hearing me today God and thank you for bringing Darren and I back together. I always know Darren and I have a wonderful future together and you will help to support me during this time while I need to be patient and allow you to work it out.\nThank you for answering my prayer and for Darren and I to be back in our loving relationship \n\nAmen"
  },
  {
    "Name": "Anonymous",
    "Date": "January 2, 2023",
    "Email": "mr58033@yahoo.com",
    "Phone": "",
    "Prayer Request": "Please pray that God would heal me and help me in my career. Pray that God would restore my peace and give me supernatural joy and patience. Pray that God would take care of everything that's been giving me anxiety at work. Finally pray that God would help me overcome sin in my life. "
  },
  {
    "Name": "Kitty & Erin",
    "Date": "January 2, 2023",
    "Email": "seagreeneyes103@yahoo.com",
    "Phone": "",
    "Prayer Request": "Urgent prayers needed for my cat Kitty - please pray her health improves miraculously & dramatically, especially her appetite. She is 22, Please pray she regains her appetite, gains weight & is extremely healthy, active, happy & cozy here with us for many more years!"
  },
  {
    "Name": "Prer",
    "Date": "January 2, 2023",
    "Email": "prernasharma9540@gmail.com",
    "Phone": "",
    "Prayer Request": "Heavenly Father , we pray for vishal that he got full remission from cancer , i decree and declare that cancer is removed from his body right now in Jesus name , heal him right now , send your angels to protect him from any evil disease and evil eyes , we need you lord please answer my prayers Amen Amen Amen"
  },
  {
    "Name": "Anonymous",
    "Date": "January 2, 2023",
    "Email": "angelmccan6@gmail.com",
    "Phone": "",
    "Prayer Request": "This has been a very hard year for me. Someone I knew assaulted me in the worst way possible. It damaged me that I couldn’t stop it. I wasn’t strong enough to get him to stop. No matter how much I cried it didn’t matter to him. After that day I have felt upset and angry. I tried to get help it has been almost 3months and I’m still waiting on an officer to take my case. Within the same months my mom had serious surgery I pray that the lord protects her allow her to live happily and healthy. My mind is in constant worry, fear and stress about those and my future with music. Negative thoughts tells me I’ll never be good enough or there is better multi talented musicians. It scares me that one day I’ll live to regret the major I chose to pursue music. "
  }
]